group_position_name = {
    0: 'Школа, Дом творчества',
    1: 'Университет, Колледж',
    2: 'Офис компании, учебный центр ОНПЗ',
    3: 'Установка атмосферно-вакуумной перегонки',
    4: 'Газофракционирующая установка',
    5: 'Установка изомеризации и установка каталитического риформинга',
    6: 'Установка гидроочистки, установка производства серы',
    7: 'Установка кат.крекинга и гидрокрекинга, МТБЭ, установка алкилирования',
    8: 'Установка замедленного коксования, установка производства нефтяного битума',
    9: 'Товарный парк и лаборатория',
}

group_name_position = {
    'Школа, Дом творчества': 0,
    'Университет, Колледж': 1,
    'Офис компании, учебный центр ОНПЗ': 2,
    'Установка атмосферно-вакуумной перегонки': 3,
    'Газофракционирующая установка': 4,
    'Установка изомеризации и установка каталитического риформинга': 5,
    'Установка гидроочистки, установка производства серы': 6,
    'Установка кат.крекинга и гидрокрекинга, МТБЭ, установка алкилирования': 7,
    'Установка замедленного коксования, установка производства нефтяного битума': 8,
    'Товарный парк и лаборатория': 9,
}

team_way = {
    0: '0-1-2-7-2',
    1: '0-1-2-9-2',
    2: '0-1-2-7-2',
    3: '0-1-2-3-2',
    4: '0-1-2-4-2',
    5: '0-1-2-5-2',
    6: '0-1-2-6-2',
    7: '0-1-2-7-2',
    8: '0-1-2-8-2',
    9: '0-1-2-9-2'
}
