second_part_one = {
    0: """Твоему персонажу нравилось учиться в школе, он увлекался химией

Он посещал Дом творчества, любил петь и играть на гитаре

А какие у тебя любимые предметы?""",
    1: """Твоему персонажу нравилось учиться в школе, ему были интересна химия

Стал победителем ВСОШ по химии, с помощью этого поступил в ВУЗ

Также его увлечением был спорт, он занимался плаванием 🏊

А какие у тебя любимые предметы? """,
    2: """Твоему персонажу нравилось учиться в школе, ему были интересны естественные науки, особенно химия 

Также он участвовал в «Pro нефть»

А какие у тебя любимые предметы? 

""",
    3: """Твоему персонажу нравилось учиться в школе, ему была интересна химия и он учавствовал в «Социальная сеть в реальности»

Также его увлечением был спорт🥊

А какие у тебя любимые предметы? 
""",
    4: '''Твоему персонажу нравилось учиться в школе, ему были интересны естественные науки, особенно химия. Он посещал "Школьный факультет"  

Также его увлечением был спорт, он занимался плаванием 🏊

А какие у тебя любимые предметы?
''',
    5: """Твоему персонажу нравилось учиться в школе, ему были интересны точные науки, особенно физика и ИТ. 

Также он участвовал в Квест олимпиаде и занял призовое место 🏆
А какие у тебя любимые предметы? 
""",
    6: """Твоему персонажу нравилось учиться в школе, ему были интересны такие предметы, как химия и физика

Также он был активистом в школьного самоуправления, устраивал мероприятия 🎉

А какие у тебя любимые предметы? 

""",
    7: """Твоему персонажу нравилось учиться в школе, ему были интересны естественные науки, особенно химия 

Также его увлечением был спорт, он посещал секцию футбола ⚽

А какие у тебя любимые предметы? 
""",
    8: '''Твоему персонажу нравилось учиться в школе, ему были интересны точные науки, особенно физика 

Также он посещал "Летнюю академию наук" 👓


А какие у тебя любимые предметы? 
''',
    9: """Твоему персонажу нравилось учиться в школе, ему были интересны естественные науки, особенно химия 

Также он занимался волонтерством и любил животных 🐱🐶

А какие у тебя любимые предметы? 
"""
}

second_part_middle_two = {
    0: '''Ты учишься в Омском промышленно-экономическом колледже по направлению «Технология аналитического  контроля химических соединений»

Во время учебы твой персонаж получил знания и представлял свой факультет в творческих мероприятиях, выступал на Дне нефтяника и Дне химика
''',
    1: '''Ты учишься на бакалавриате по направлению «Химическая технология» профилю подготовки «Химическая технология природных энергоносителей и углеродных материалов» 

Во время учебы твой персонаж получил знания и умения в области химии и технологии нефтепереработки, получал именную стипендию
''',
    2: '''Ты учишься в Университетском химико-механическом  колледже по направлению «Химическая технология орг. веществ»

Во время учебы твой персонаж участвовал в программе «Социальная сеть в реальности» 
''',
    3: '''Ты учишься в Университетском химико механическом колледже по направлению «Переработка нефти и газа»

Во время учебы твой персонаж получил знания и участвовал в кейс турнире «Pro нефть»
''',
    4: '''Ты учишься на бакалавриате ОмГТУ Базовой кафедры ПАО «Газпром нефть» по направлению «Химическая технология органических веществ» 

Во время учебы твой персонаж также участвовал в НТК «Молодой ученый».
''',
    5: '''Ты учишься на бакалавриате Омского государственного университета по направлению
«Инжиниринг технологических объектов на базе цифровых платформ» и 
проходил производственную практику в «Газпромнефть ОНПЗ»

Во время учебы твой персонаж получил знания и умения в области химии и технологии нефтепереработки
''',
    6: '''Ты учишься в Омском государственном университете   на бакалавриате по направлению«Технологические машины и оборудование» профилю подготовки «Машины и оборудование переработки углеродных материалов»

Во время учебы твой персонаж прошел стажировску на Омском НПЗ
''',
    7: '''Ты учишься в Университетском химико-механическом колледже по направлению «Переработка нефти и газа»


Во время учебы твой персонаж был в сборной по футболу в команде колледжа 
''',
    8: '''Ты учишься в Омском государственном университете на бакалавриате по направлению «Машины и аппараты химических производств»

Также он участвовал в разработке автоматизации установки замедленного коксования и производства битума и получил новые знания
''',
    9: '''Ты учишься в Омском государственном университете на бакалавриате по направлению «Химия»

Во время учебы твой персонаж был волонтёром
'''
}

second_part_two = {
    0: """Поздравляем! Ты сейчас находишься на вручении дипломов! Твой персонаж успешно окончил высшее учебное заведение 🧑‍🎓

Он окончил обучение на бакалавриате по направлению «Химическая технология» профилю подготовки «Химическая технология природных энергоносителей и углеродных материалов» 

Во время учебы твой персонаж получил знания и умения в области химии и технологии нефтепереработки
""",
    1: """Поздравляем! Ты сейчас находишься на вручении дипломов! Твой персонаж успешно окончил высшее учебное заведение 🧑‍🎓

Он окончил обучение на бакалавриате по направлению «Химическая технология» профилю подготовки «Химическая технология органических веществ» 

Во время учебы твой персонаж получил знания и умения в области технологии современных нефтехимических процессов переработки нефти
""",
    2: """Поздравляем! Ты сейчас находишься на вручении дипломов! Твой персонаж успешно окончил высшее учебное заведение 🧑‍🎓

Он окончил обучение на бакалавриате по направлению «Энерго- и ресурсосберегающие процессы в химической технологии, нефтехимии и биотехнологии» профилю подготовки «Газохимия» 

Во время учебы твой персонаж получил знания и умения в области газоперерабатывающей и газохимической промышленности
""",
    3: """Поздравляем! Ты сейчас находишься на вручении дипломов! Твой персонаж успешно окончил высшее учебное заведение 🧑‍🎓

Он окончил обучение на бакалавриате по направлению «Энерго- и ресурсосберегающие процессы в химической технологии, нефтехимии и биотехнологии» профилю подготовки «Охрана окружающей среды и рациональное использование природных ресурсов» 

Во время учебы твой персонаж получил знания и навыки в области охраны водных объектов и атмосферного воздуха
""",
    4: """Поздравляем! Ты сейчас находишься на вручении дипломов! Твой персонаж успешно окончил высшее учебное заведение 🧑‍🎓

Он окончил обучение на бакалавриате по направлению «Химическая технология» профилю подготовки «Химическая технология природных энергоносителей и углеродных материалов» 

Во время учебы твой персонаж получил знания и умения в области химии и технологии нефтепереработки
""",
    5: """Поздравляем! Ты сейчас находишься на вручении дипломов! Твой персонаж успешно окончил высшее учебное заведение 🧑‍🎓

Он окончил обучение на бакалавриате по направлению «Энерго- и ресурсосберегающие процессы в химической технологии, нефтехимии и биотехнологии» профилю подготовки «Газохимия» 

Во время учебы твой персонаж получил знания и умения в области газоперерабатывающей и газохимической промышленности
""",
    6: """Поздравляем! Ты сейчас находишься на вручении дипломов! Твой персонаж успешно окончил высшее учебное заведение 🧑‍🎓

Он окончил обучение на бакалавриате по направлению «Химическая технология» профилю подготовки «Химическая технология природных энергоносителей и углеродных материалов» 

Во время учебы твой персонаж получил знания и умения в области химии и технологии нефтепереработки
""",
    7: """Поздравляем! Ты сейчас находишься на вручении дипломов! Твой персонаж успешно окончил высшее учебное заведение 🧑‍🎓

Он окончил обучение на бакалавриате по направлению «Энерго- и ресурсосберегающие процессы в химической технологии, нефтехимии и биотехнологии» профилю подготовки «Охрана окружающей среды и рациональное использование природных ресурсов» 

Во время учебы твой персонаж получил знания и навыки в области охраны водных объектов и атмосферного воздуха
""",
    8: """Поздравляем! Ты сейчас находишься на вручении дипломов! Твой персонаж успешно окончил высшее учебное заведение 🧑‍🎓

Он окончил обучение на бакалавриате по направлению «Химическая технология» профилю подготовки «Химическая технология природных энергоносителей и углеродных материалов» 

Во время учебы твой персонаж получил знания и умения в области химии и технологии нефтепереработки
""",
    9: """Поздравляем! Ты сейчас находишься на вручении дипломов! Твой персонаж успешно окончил высшее учебное заведение 🧑‍🎓

Он окончил обучение на бакалавриате по направлению «Химическая технология» профилю подготовки «Химическая технология органических веществ» 

Во время учебы твой персонаж получил знания и умения в области технологии современных нефтехимических процессов переработки нефти
"""
}
second_part_three = {
    0: '''Подойди к участку "Установка каталитического крекинга" и приложи своего человечка к специальному блоку''',
    1: '''Подойди к участку "Лаборатория" и приложи своего человечка к специальному блоку''',
    2: '''Подойди к участку "Установка алкилирования" и приложи своего человечка к специальному блоку''',
    3: '''Подойди к участку "Установка атмосферно-вакуумной перегонки" и приложи своего человечка к специальному блоку''',
    4: '''Подойди к участку "Газофракционирующая установка" и приложи своего человечка к специальному блоку''',
    5: '''Подойди к участку "Установка изомеризации и установка каталитического риформинга" и приложи своего человечка к специальному блоку''',
    6: '''Подойди к участку "Установка гидроочистки и установка производства серы" и приложи своего человечка к специальному блоку''',
    7: '''Подойди к участку "Установка каталитического крекинга, установка гидрокрекинга,установка производства МТБЭ и установка алкилирования" и приложи своего человечка к специальному блоку''',
    8: '''Подойди к участку "Установка замедленного коксования и установка производства нефтяного  битума" и приложи своего человечка к специальному блоку''',
    9: '''Подойди к участку "Товарный парк и лаборатория" и приложи своего человечка к специальному блоку'''
}

second_part_rooms = {
    0: "Установка... каталитического крекингааа! Круто?😏",
    1: "Лабораторияяя! Круто?😏",
    2: "Установка... алкилирования! Круто?😏",
    3: "Установка... атмосферно-вакуумной перегонки! Круто?😏",
    4: "Установка... газофракционирующая! Круто?😏",
    5: "Установка... риформинга! Круто?😏",
    6: "Установка... гидроочистки! Круто?😏",
    7: "Установка... гидрокрекинга! Круто?😏",
    8: "Установка... замедленного коксования! Круто?😏",
    9: "Лабораторияяя! Круто?😏"
}
second_part_four = {
    0: """Ты находишься на установке каталитического крекинга

Ознакомься с построением этой установки
""",
    1: """Ты находишься в лаборатории

Ознакомься с построением этого здания
""",
    2: """Ты находишься на установке алкилирования

Ознакомься с построением этой установки
""",
    3: """Ты находишься на установке атмосферно-вакуумной перегонки (АВТ) на блоке вакуумной перегонки нефти

Ознакомься с построением этой установки
""",
    4: """Ты находишься на газофракционирующей установке 

Ознакомься с построением данной установки
""",
    5: """Ты находишься на установке каталитического риформинга

Ознакомься с построением этой установки
""",
    6: """Ты находишься на установке гидроочистки 

Ознакомься с построением этой установки
""",
    7: """Ты находишься на установке гидрокрекинга

Ознакомься с построением этой установ
""",
    8: """Ты находишься на установке замедленного коксования

Ознакомься с построением этой установки
""",
    9: """Ты находишься в лаборатории

Ознакомься с построением и конспектами, в которых говорится о данной установке
"""
}
second_part_five = {
    0: """Именно здесь твой персонаж начинает свою работу в сфере нефтепереработки

Он является оператором 3 разряда. И работает он на технологической установке каталитического крекинга

Что делает твой персонаж на установке:

▪️обеспечивает бесперебойную работу оборудования установки, когда нужно изменяет параметры установки;
▪️участвует в ремонте технологической установки;
▪️ отбирает пробы сырья и готовой продукции

Молодец! Теперь ты знаешь, чем занимается твой персонаж на установке😎
""",
    1: """Именно здесь твой персонаж начинает свою работу в сфере нефтепереработки

Он является лаборантом химического анализа 3 разряда и работает в единой лаборатории НПЗ

К ним в лабораторию привезли пробы с технологической установки гидроочистки

Что делает твой персонаж:

▪️проводит анализы по установленному алгоритму средней степени сложности;
▪️ведет прием и учет проб, поступивших в лабораторию;
▪️проводит анализы нефтепродуктов, например, исследует их вязкость, плотность;
▪️контролирует работу лабораторных приборов и установок, а также записывает их показания

Для установки гидроочистки лаборант может анализировать, например, содержание серы в дизельном топливе
 
Молодец! Теперь ты знаешь, чем занимается твой персонаж на установке😎""",
    2: """Твой персонаж начинает свою работу в сфере нефтепереработки

Он является оператором 3 разряда. И работает он на технологической установке алкилирования

Что делает твой персонаж:

▪️ контролирует работу установки каталитического крекинга, следит за состоянием оборудования, производит необходимую настройку и установку параметров для оптимальной работы процесса.

▪️ следит за ходом процесса крекинга, контролирует температуру, давление

▪️  должен быстро реагировать, проводить диагностику и устранять неполадки для продолжения безаварийной работы процесса.

▪️ также может производить анализ данных, проводить испытания, делать отчеты по ходу процесса

Молодец! Теперь ты знаешь, чем занимается оператор установки алкилирования😎
""",
    3: """Именно здесь твой персонаж начинает свою работу в сфере нефтепереработки

Он является оператором 3 разряда. И работает он на технологической установке АВТ на блоке атмосферной перегонки нефти

Что делает твой персонаж:

▪️обеспечивает бесперебойную работу оборудования установки, когда нужно изменяет параметры установки;

▪️участвует в ремонте технологической установки;

▪️ отбирает пробы сырья и готовой продукции

Молодец! Теперь ты знаешь, чем занимается оператор установки АВТ на блоке атмосферной перегонки нефти😎
""",
    4: """Именно здесь твой персонаж начинает свою работу в сфере нефтепереработки

Он является оператором 3 разряда. И работает он на технологической газофракционирующей установке 

Что делает твой персонаж:

▪️ обеспечивает бесперебойную работу оборудования установки, когда нужно изменяет параметры установки;

▪️ участвует в ремонте технологической установки;

▪️ контролирует качество сырья, реагентов и продуктов

Молодец! Теперь ты знаешь, чем занимается оператор газофракционирующей установки😎 
""",
    5: """Именно здесь твой персонаж начинает свою работу в сфере нефтепереработки

Он является машинистом 3 разряда. И работает он на технологической установке каталитического риформинга

Что делает твой персонаж:

▪️ обеспечивает бесперебойную работу оборудования установки, когда нужно изменяет параметры установки;

▪️ участвует в ремонте технологической установки;

▪️ отбирает пробы сырья и готовой продукции

Молодец! Теперь ты знаешь, чем занимается машинист установки каталитического риформинга😎
""",
    6: """Твой персонаж начинает свою работу в сфере нефтепереработки

Он является машинистом 3 разряда. И работает он на технологической установке гидроочистки

Что делает твой персонаж:

▪️ следит за работой установки гидроочистки, контролирует работу различного оборудования, такого как насосы, реакторы, фильтры и другие устройства, обеспечивая их правильное функционирование.

▪️ наблюдает за процессом гидроочистки, следит за параметрами работы (давление, температура, расход сырья и т.д.), чтобы обеспечить стабильность и эффективность процесса.

▪️ проводит профилактические работы оборудования, устраняет мелкие неисправности и следит за состоянием техники.

Молодец! Теперь ты знаешь,чем занимается машинист установки гидроочистки😎 
""",
    7: """Именно здесь твой персонаж начинает свою работу в сфере нефтепереработки

Он является оператором 3 разряда. И работает он на технологической установке гидрокрекинга

Что делает твой персонаж:

▪️обеспечивает бесперебойную работу оборудования установки, когда нужно изменяет параметры установки;
▪️участвует в ремонте технологической установки;
▪️ отбирает пробы сырья и готовой продукции

Молодец! Теперь ты знаешь, чем занимается оператор установки гидрокрекинга😎
""",
    8: """Именно здесь твой персонаж начинает свою работу в сфере нефтепереработки

Он является машинистом 3 разряда. И работает он на технологической установке замедленного коксования

Что делает твой персонаж:

▪️ обеспечивает бесперебойную работу оборудования установки, когда нужно изменяет параметры установки;
▪️ участвует в ремонте технологической установки;
▪️ отбирает пробы сырья и готовой продукции

Молодец! Теперь ты знаешь, чем занимается машинист установки замедленного коксования😎
""",
    9: """Именно здесь твой персонаж начинает свою работу в сфере нефтепереработки

Он является лаборантом химического анализа 3 разряда и работает в единой лаборатории НПЗ

К ним в лабораторию привезли пробы с технологической установки гидроочистки

Что делает твой персонаж:

▪️проводит анализы по установленному алгоритму средней степени сложности;
▪️ведет прием и учет проб, поступивших в лабораторию;
▪️проводит анализы нефтепродуктов, например, исследует их вязкость, плотность;
▪️контролирует работу лабораторных приборов и установок, а также записывает их показания

Для установки гидроочистки лаборант может анализировать, например, содержание серы в дизельном топливе
 
Молодец! Теперрь ты знаешь, чем занимается лаборант химического анализа😎
"""
}

second_part_middle_five = {
    0: """А теперь я расскажу чем же любит заниматься твой персонаж😉

Со школьных времен тебя интересовала творческая жизнь, и ты был одним из наилучших в своем деле. Благодаря своим творческим способностям ты выступал на Дне нефтяника🎈
""",
    1: """А теперь я расскажу чем же любит заниматься твой персонаж😉

Ты со школьных времен интересовался различными машинами, и почему так сильно важно октановое число для этого вида транспорта.Благодаря своим знаниям ты смог придумать новый состав бензина 😉 
""",
    2: """А теперь я расскажу чем же любит заниматься твой персонаж😉

Ты со школьных времён интересовался не только химией, но и любил все связаное с социальной сетью. Благодаря этим навыкам ты помогаешь записывать ролики для молодых операторов😎
""",
    3: """А теперь я расскажу чем же любит заниматься твой персонаж😉

Ты со школьных времен изучал всё про нефть и любил разные мероприятия, связанные с нефтепереработкой! Вот такой у тебя крутой персонаж и он даже смог создать свой кейс-турнир для Pro нефть😊
""",
    4: """А теперь я расскажу чем же любит заниматься твой персонаж😉

Ты со школьных времен придумывал разные изобретения. Одним из наилучших оказался новый вид каски. Благодаря своим знаниям и умениям ты участвовал в научно-техническом комитете со своим новым открытием 🙂
""",
    5: '''А теперь я расскажу чем же любит заниматься твой персонаж😉

Со школьных времен ты любил разные квест-олимпиады и занимал только призовые места. Благодаря своим навыкам и умениям ты смог стать участником праграммы "Три рубежа"😊
''',
    6: """А теперь я расскажу чем же любит заниматься твой персонаж😉

Со школьных времен ты увлекался разными науками и удивлялся работе нефтяников. Благоадря своим знаниям и навыкам ты участвовал в конкурсе профессионального мастерства и смог победить 😀
""",
    7: """А теперь я расскажу чем же любит заниматься твой персонаж😉

Со школьных времен ты очень полюбил здоровый образ жизни и благодаря своему здоровью и навыкам смог привить спорт остальным. Ты создал свою команду на установке и выступал на турнире по футболу⚽
""",
    8: """А теперь я расскажу чем же любит заниматься твой персонаж😉

Со школьных времен тебя интересовали точные науки. Ты любил изучать что-то новое  в научной сфере и благодаря этим знаниям выступал на научно-техническом комитете с проектом по автоматизации 😏
""",
    9: """А теперь я расскажу чем же любит заниматься твой персонаж😉

Со школьных времен тебе нравились животные, и ты всегда помогал им. Благоадря своей добродушности и знаниям именно ты смог стать куратором программы корпоративного волонтерства  🐶
"""
}

second_part_six = {
    0: """Ураааа,ты получил 6 разряд и стал оператором установки каталитического крекинга 6 разряда""",
    1: """Ураааа,ты получил 5 разряд и стал лаборантом 5 разряда""",
    2: """Ураааа,ты получил 6 разряд и стал оператором установки  алкилирования 6 разряда""",
    3: """Ураааа,ты получил 6 разряд и стал оператором установки АВТ 6 разряда""",
    4: """Ураааа,ты получил 7 разряд и стал оператором установки ГФУ 7 разряда""",
    5: """Ураааа,ты получил 6 разряд и стал машинистом установки риформинга 6 разряда""",
    6: """Ураааа,ты получил 6 разряд и стал оператором установки гидроочистки 6 разряда""",
    7: """Ураааа,ты получил 6 разряд и стал оператором кат крекинга 6 разряда""",
    8: """Ураааа,ты получил 6 разряд и стал машинистом установки установки замедленного коксования 6 разряда""",
    9: """Ураааа,ты получил 5 разряд и стал лаборантом 5 разряда"""
}
second_part_seven = {
    0: """Подойди к участку "Установка атмосферно-вакуумной перегонки" и приложи своего человечка к специальному блоку""",
    1: """Подойди к участку "Установка изомеризации и установка каталитического риформинга" и приложи своего человечка к специальному блоку""",
    2: """Подойди к участку "Газофракционирующая установка" и приложи своего человечка к специальному блоку""",
    3: """Подойди к участку "Установка гидроочистка" и приложи своего человечка к специальному блоку""",
    4: """Подойди к участку "Установка замедленного коксования и установка производства нефтяного  битума" и приложи своего человечка к специальному блоку""",
    5: """Подойди к участку "Установка каталитического крекинга и установка гидрокрекинга" и приложи своего человечка к специальному блоку""",
    6: """Подойди к участку "Установка атмосферно-вакуумной перегонки" и приложи своего человечка к специальному блоку""",
    7: """Подойди к участку "Установка каталитического крекинга и установка гидрокрекинга" и приложи своего человечка к специальному блоку""",
    8: """Подойди к участку "Установка замедленного коксования и установка производства нефтяного  битума" и приложи своего человечка к специальному блоку""",
    9: """Подойди к участку "Установка изомеризации и установка каталитического риформинга" и приложи своего человечка к специальному блоку"""
}
second_part_eight = {
    0: """Ты снова находишься на установке атмосферно-вакуумной перегонки (АВТ) на блоке атмосферной перегонки нефти""",
    1: """Ты снова находишься на установке изомеризации """,
    2: """Ты снова находишься на газофракционирующей установке""",
    3: """Ты снова находишься на установке гидроочистки""",
    4: """Ты снова находишься на установке замедленного коксования""",
    5: """Ты снова находишься на установке каталитического крекинга""",
    6: """Ты снова находишься на установке атмосферно-вакуумной перегонки (АВТ) на блоке вакуумной перегонки нефти""",
    7: """Ты снова находишься на установке гидрокрекинга""",
    8: """Ты снова находишься на установке производства нефтяного битума""",
    9: """Ты снова находишься на установке каталитического риформинга"""
}
second_part_nine = {
    0: """Теперь твой персонаж является оператором 4 разряда

Что же делает твой персонаж? У него появились новые обязанности и увеличилась ответственность

▪️регулирует производительность блока, установки;
▪️ предупреждает и устраняет отклонения процесса от заданного режима;
▪️ осуществляет пуск и вывод установки на режим;
▪️ осуществляет остановку установки;
▪️ подготавливает к ремонту отдельные аппараты и установку в целом

Теперь ты знаешь, чем занимается оператор 4 разряда установки атмосферно-вакуумной перегонки  на блоке атмосферной перегонки нефти
""",
    1: """Теперь твой персонаж является лаборантом 4 разряда

Что же делает твой персонаж? У него появились новые обязанности и увеличилась ответственность

▪️ проводит анализы сложной степени;
▪️обрабатывает полученные результаты химического исследования с применением средств современной вычислительной техники;
▪️использует схемы и инструкции при сборке лабораторного оборудования;
▪️ведет расчеты результатов анализов и их документальное оформление

Теперь ты знаешь, чем занимается лаборант химического анализа 4 разряда 
""",
    2: """Теперь твой персонаж является оператором 4 разряда

Что же делает твой персонаж? У него появились новые обязанности и увеличилась ответственность

▪️регулирует производительность блока, установки;
▪️ предупреждает и устраняет отклонения процесса от заданного режима;
▪️ осуществляет пуск и вывод установки на режим;
▪️ осуществляет остановку установки;
▪️ подготавливает к ремонту отдельные аппараты и установку в целом

Теперь ты знаешь, чем занимается оператор 4 разряда газофракционирующей установки 
""",
    3: """Теперь твой персонаж является лаборантом 4 разряда

Что же делает твой персонаж? У него появились новые обязанности и увеличилась ответственность

▪️проводит анализы сложной степени;
▪️ обрабатывает полученные результаты химического исследования с применением средств современной вычислительной техники;
▪️ использует схемы и инструкции при сборке лабораторного оборудования;
▪️ ведет расчеты результатов анализов и их документальное оформление

Теперь ты знаешь, чем занимается лаборант химического анализа 4 разряда 
""",
    4: """Теперь твой персонаж является оператором 4 разряда

Что же делает твой персонаж? У него появились новые обязанности и увеличилась ответственность

▪️регулирует производительность блока, установки;
▪️ предупреждает и устраняет отклонения процесса от заданного режима;
▪️ осуществляет пуск и вывод установки на режим;
▪️ осуществляет остановку установки;
▪️ подготавливает к ремонту отдельные аппараты и установку в целом

Теперь ты знаешь, чем занимается оператор 4 разряда установки замедленного коксования
""",
    5: """Теперь твой персонаж является оператором 4 разряда

Что же делает твой персонаж? У него появились новые обязанности и увеличилась ответственность

▪️регулирует производительность блока, установки;
▪️ предупреждает и устраняет отклонения процесса от заданного режима;
▪️ осуществляет пуск и вывод установки на режим;
▪️ осуществляет остановку установки;
▪️ подготавливает к ремонту отдельные аппараты и установку в целом

Теперь ты знаешь, чем занимается оператор 4 разряда установки каталитического крекинга 
""",
    6: """Теперь твой персонаж является оператором 4 разряда

Что же делает твой персонаж? У него появились новые обязанности и увеличилась ответственность

▪️регулирует производительность блока, установки;
▪️ предупреждает и устраняет отклонения процесса от заданного режима;
▪️ осуществляет пуск и вывод установки на режим;
▪️ осуществляет остановку установки;
▪️ подготавливает к ремонту отдельные аппараты и установку в целом

Теперь ты знаешь, чем занимается оператор 4 разряда установки атмосферно-вакуумной перегонки (АВТ) на блоке вакуумной перегонки нефти
""",
    7: """Теперь твой персонаж является оператором 4 разряда

Что же делает твой персонаж? У него появились новые обязанности и увеличилась ответственность

▪️регулирует производительность блока, установки;
▪️ предупреждает и устраняет отклонения процесса от заданного режима;
▪️ осуществляет пуск и вывод установки на режим;
▪️ осуществляет остановку установки;
▪️ подготавливает к ремонту отдельные аппараты и установку в целом

Теперь ты знаешь, чем занимается оператор 4 разряда установки гидрокрекинга
""",
    8: """Теперь твой персонаж является оператором 4 разряда

Что же делает твой персонаж? У него появились новые обязанности и увеличилась ответственность

▪️регулирует производительность блока, установки;
▪️ предупреждает и устраняет отклонения процесса от заданного режима;
▪️ осуществляет пуск и вывод установки на режим;
▪️ осуществляет остановку установки;
▪️ подготавливает к ремонту отдельные аппараты и установку в целом

Теперь ты знаешь, чем занимается оператор 4 разряда установки производства нефтяного битума
""",
    9: """Теперь твой персонаж является оператором 4 разряда

Что же делает твой персонаж? У него появились новые обязанности и увеличилась ответственность

▪️регулирует производительность блока, установки;
▪️ предупреждает и устраняет отклонения процесса от заданного режима;
▪️ осуществляет пуск и вывод установки на режим;
▪️ осуществляет остановку установки;
▪️ подготавливает к ремонту отдельные аппараты и установку в целом

Теперь ты знаешь, чем занимается оператор 4 разряда установки каталитического риформинга
"""
}
second_part_ten = {
    0: """Ого-го, какая же интересная тема попалась твоей команде!Цифровизация - важный процесс на любом современном предприятии. К примеру, Омский нефтеперерабатывающий завод активно внедряет цифровые технологии в различных отраслях. В 2023 году Омский нефтеперабатывающий завод открыл образовательное пространство, где работники проходят тренинги на компьютерных VR-тренажерах.Ты даже не можешь себе представить, насколько это весело, но в то же время познавательно!🤯

Ярким примером также является применение цифрового двойника Омского нефтеперерабатывающего завода.Виртуальный аналог реального объекта позволяет в реальном времени определять наиболее оптимальный режим технологических процессов и добиваться максимальной экономической эффективности.🤓
""",
    1: """Ого-го, какая же интересная тема попалась твоей команде!Цифровизация - важный процесс на любом современном предприятии. К примеру, Омский нефтеперерабатывающий завод активно внедряет цифровые технологии в различных отраслях. В 2023 году Омский нефтеперабатывающий завод открыл образовательное пространство, где работники проходят тренинги на компьютерных VR-тренажерах.Ты даже не можешь себе представить, насколько это весело, но в то же время познавательно!🤯

Ярким примером также является применение цифрового двойника Омского нефтеперерабатывающего завода.Виртуальный аналог реального объекта позволяет в реальном времени определять наиболее оптимальный режим технологических процессов и добиваться максимальной экономической эффективности.🤓
""",
    2: """Вау! Вашей команде попалась такая интересная тема! Наверняка ты много слышал и знаешь про роль экологии в нашей современной жизни! Предприятиям важно сокращать воздействие на окружающую среду. Омский нефтеперерабатывающий завод внедряет новые подходы для сокращения вредных выбросов, а также применяет солнечную энергию, что очень позитивно влияет на экологическую ситуацию! Экологический эффект также обеспечивается выводом из эксплуатации установок предыдущего поколения и внедрением природосберегающих технологий на новых.🤓

Только представь, благодаря модернизации Омский НПЗ уже сократил на 40% общее воздействие на окружающую среду, а с завершением всех работ по модернизации снизит еще на 25%! 🤯
""",
    3: """Вау! Вашей команде попалась такая интересная тема! Наверняка ты много слышал и знаешь про роль экологии в нашей современной жизни! Предприятиям важно сокращать воздействие на окружающую среду. Омский нефтеперерабатывающий завод внедряет новые подходы для сокращения вредных выбросов, а также применяет солнечную энергию, что очень позитивно влияет на экологическую ситуацию! Экологический эффект также обеспечивается выводом из эксплуатации установок предыдущего поколения и внедрением природосберегающих технологий на новых.🤓

Только представь, благодаря модернизации Омский НПЗ уже сократил его на 40% общее воздействие на окружающую среду, а с завершением всех работ по модернизации снизит еще на 25%! 🤯
""",
    4: """О! Вашей команде попалась такая интересная тема! Что же такое непрофильные активы предприятия? Непрофильными называются активы, которые не относятся к основной деятельности компании и не являются ее базовым источником доходов. 🤑

Управление непрофильными активами требует тщательного анализа и планирования. Омский НПЗ постоянно совершенствует свои методы работы с этими активами, чтобы достичь максимальной эффективности и прибыльности.
""",
    5: """О! Вашей команде попалась такая интересная тема! Что же такое непрофильные активы предприятия? Непрофильными называются активы, которые не относятся к основной деятельности компании и не являются ее базовым источником доходов. 🤑

Управление непрофильными активами требует тщательного анализа и планирования. Омский НПЗ постоянно совершенствует свои методы работы с этими активами, чтобы достичь максимальной эффективности и прибыльности.
""",
    6: """Ого! Твоей команде попалась такая интересная тема! Внешний кадровый резерв - это очень важная штука! Чтобы найти лучших сотрудников Омский НПЗ активно работает со школьным и студенческим сообществами по программе «Школа — ссуз/вуз — ОНПЗ»!

Начиная со школьной скамьи и участвуя в мероприятиях Омского НПЗ, ребята получают очень важные знания, которые непременно пригодятся им в будущем!📖
""",
    7: """Ого! Твоей команде попалась такая интересная тема! Внешний кадровый резерв - это очень важная штука! Чтобы найти лучших сотрудников Омский НПЗ активно работает со школьным и студенческим сообществами по программе «Школа — ссуз/вуз — ОНПЗ»!

Начиная со школьной скамьи и участвуя в мероприятиях Омского НПЗ, ребята получают очень важные знания, которые непременно пригодятся им в будущем!📖
""",
    8: """Ух ты! Какая же интересная тема досталась вашей команде! Программа “Здоровье и благополучие” является одним из ключевых направлений деятельности Омского НПЗ. Предприятие регулярно проводит различные мероприятия, направленные на поддержание здоровья работников, проводит профилактические медицинских осмотры, а также вакцинацию против гриппа и других заболеваний. Спорт очень важен для сохранения и поддержания здоровья, именно поэтому Омский НПЗ занимается организацией занятий по физической культуре и спорту!

Очень важно, чтобы сотрудники чувствовали себя комфортно на рабочем месте, развивались и самосовершенствовались и, конечно, были здоровыми! 🤸‍♀️
""",
    9: """Ух ты! Какая же интересная тема досталась вашей команде! Программа “Здоровье и благополучие” является одним из ключевых направлений деятельности Омского НПЗ. Предприятие регулярно проводит различные мероприятия, направленные на поддержание здоровья работников, проводит профилактические медицинских осмотры, а также вакцинацию против гриппа и других заболеваний. Спорт очень важен для сохранения и поддержания здоровья, именно поэтому Омский НПЗ занимается организацией занятий по физической культуре и спорту!

Очень важно, чтобы сотрудники чувствовали себя комфортно на рабочем месте, развивались и самосовершенствовались и, конечно, были здоровыми! 🤸‍♀️
"""
}
second_part_eleven = {
    0: """С каждым годом значение цифровизации будет неизменно расти, возможно люди на заводе будут работать с помощью роботов! Давай и ты придумаешь робота! Какие бы функции он выполнял? Как его применение упростило бы труд человека на заводе?🦾

Покажи как бы выглядел твой робот и наверняка твое изобретение стало бы прорывом на заводе! Возможно ты применишь в своей разработке даже летательные аппараты! 
""",
    1: """Ты никогда не думал о том, как сделать человека еще сильнее и выносливее? Возможно внедрение экзоскелетов на заводах решит эту задачу! Представь себе, что это что-то вроде "механической одежды", которая помогает усилить человеческие возможности.

Давай ты придумаешь собственный бренд экзоскелетов! Покажи на макете из каких материалов он будет изготавливаться и как облегчит человеческий труд на заводе! 🦾
""",
    2: """Каким же еще образом можно получать энергию для завода, чтобы еще больше снизить экологическое воздействие? О, придумал! Что если нам использовать природную энергию, например, ветер?

Подумай. как и с помощью чего можно можно этого добиться! 🪁
""",
    3: """Хмм..А как же еще можно получать энергию для завода, чтобы больше снизить воздействие на окружающую среду? Что если мы используем растения, которые помогли бы нам снижать вредные выбросы?

Придумай, как можно этого добиться? Где бы ты высадил эти растения? Уверен, это будет полезно для окружающего мира, а также очень красиво!🌼
""",
    4: """Ты знал, что серу применяют в производстве резины? Это очень интересный процесс, который называется вулканизация серы!🌋

Хм...Что если ты сделаешь непрофильным активом завода производство шин из этой резины? Подумай, как можно оформить такое производство в рамках предприятия!
""",
    5: """Сейчас большой объем работы можно выполнять дистанционно и некоторые площади завода пустуют!

Хм... Что если ты сделаешь непрофильным активом завода сдачу в аренду этих площадей? Придумай, по до что можно использовать эти площади, может быть для других сфер бизнеса?🧐
""",
    6: """Хм.. а тебе бы хотелось побывать на предприятии и увидеть все своими глазами? А что если ты придумаешь, как провести экскурсию на нефтеперерабатывающем заводе?

Подумай, как соблюсти правила безопасности и сделать мероприятие познавательным для ребят! 🧠
""",
    7: """Как же весело и главное познавательно провести время? Что если ты придумаешь, как организовать фестиваль для школьников и студентов на заводе?


Придумай, какая тема была бы у мероприятия и к какой дате можно его приурочить? И не забудь, что этот фестиваль должен быть безопасным, как для участников, так и для предприятия! 🥽
""",
    8: """Хм.. Что же еще может поддержать и укрепить здоровье? Может быть сон и отдых? А что если ты придумаешь, как организовать комнаты отдыха для сотрудников предприятия?

Подумай, как бы ты обустроил такую комнату и сколько бы времени проводили там работники?


Уверен, всем нам не хватает старого-доброго сон-часа!🛌
""",
    9: """Хм.. Давай придумаем, как сделать среду на предприятии интересной и разнообразной? А что если ты придумаешь, как сотрудники могут развиваться в разных сферах даже внутри завода?


Может быть ты решишь открыть библиотеку на базе завода или организуешь кружки по интересам? Выбор за тобой, но я уверен, что ты все сделаешь здорово!🎨
"""
}
three_part_one = {
    0: """Придумай транспорт, с помощью которого можно передвигаться 🛵 по территории завода """,
    1: """Рядом с нашим заводом находится школа. 🏫 Придумай, как сотрудники могут помочь детям?""",
    2: """Часто на территорию завода прибегают дикие животные. Как сделать так, чтобы природа и предприятие гармонично сосуществовали? 🧘""",
    3: """Некоторые аппараты технологических установок имеют большие размеры, и их не всегда удобно обслуживать. Какое инновационное изобретение поможет им узнать о состоянии оборудования без необходимости личного посещения?""",
    4: """Подумай, как можно сделать процессы на заводе еще более экологичными? 🍃""",
    5: """Придумай транспорт, с помощью которого можно передвигаться 🛵 по территории завода """,
    6: """Рядом с нашим заводом находится школа. 🏫 Придумай, как сотрудники могут помочь детям?""",
    7: """Часто на территорию завода прибегают дикие животные. Как сделать так, чтобы природа и предприятие гармонично сосуществовали? 🧘""",
    8: """Некоторые аппараты технологических установок имеют большие размеры, и их не всегда удобно обслуживать. Какое инновационное изобретение поможет им узнать о состоянии оборудования без необходимости личного посещения?""",
    9: """Подумай, как можно сделать процессы на заводе еще более экологичными? 🍃"""
}
