first_part_message_one = {
    0: 'Специально для вас я выбрал отдельный участок земли. Он находится на столе с табличками  “Школа” и  "Дом творчества"',
    1: 'Специально для вас я выбрал отдельный участок земли. Он находится на столе с табличками “Университет” и "Колледж"',
    2: 'Специально для вас я выбрал отдельный участок земли. Он находится на столе с табличками “Офис компании" и "Учебный центр"',
    3: 'Специально для вас я выбрал отдельный участок земли. Он находится на столе с табличкой “Установка атмосферно-вакуумной перегонки”',
    4: 'Специально для вас я выбрал отдельный участок земли. Он находится на столе с табличкой “Газофракционирующая установка”',
    5: 'Специально для вас я выбрал отдельный участок земли. Он находится на столе с табличками "Установка каталитического риформинга" и "Установка изомеризации"',
    6: 'Специально для вас я выбрал отдельный участок земли. Он находится на столе с табличками "Установка гидроочистки" и "Установка производства серы"',
    7: 'Специально для вас я выбрал отдельный участок земли. Он находится на столе с табличками "Установка  каталитического крекинга", "Установка гидрокрекинга",  "Установка алкилирования" и  "Установка производства МТБЭ"',
    8: 'Специально для вас я выбрал отдельный участок земли. Он находится на столе с табличками  “Установка замедленного коксования" и "установка производства нефтяного битума”',
    9: 'Специально для вас я выбрал отдельный участок земли. Он находится на столе с табличками “Товарный парк” и "Лаборатория"'
}

first_part_special_one = {
    0: """Наконец-то можно приступить к изучению школы!

Надеюсь, вы станете отличной командой и сможете построить школу и уже далее, соединившись с другими установками, образуете целый комплекс – нефтеперерабатывающий завод 😊 
""",
    1: """Наконец-то можно приступить к строительству!

Надеюсь, вы станете отличной командой и сможете построить университет и уже далее, соединившись с другими установками, образуете целый комплекс – нефтеперерабатывающий завод 😊
""",
    2: """Наконец-то можно приступить к строительству!

Надеюсь, вы  станете отличной командой и сможете построить офис компании и уже далее, соединившись с другими установками, образуете целый комплекс – нефтеперерабатывающий завод 😊
""",
    3: """Наконец-то можно приступить к изучению установки! 

Надеюсь, вы станете отличной командой и сможете построить свою установку и уже далее, соединившись с другими установками, образуете целый комплекс – нефтеперерабатывающий завод 😊
""",
    4: """Наконец-то можно приступить к изучению установки!

Надеюсь, вы станете отличной командой и сможете построить свою установку и уже далее, соединившись с другими установками, образуете целый комплекс – нефтеперерабатывающий завод 😊 
""",
    5: """Наконец-то можно приступить к изучению установки!

Надеюсь, вы станете отличной командой и сможете построить свою установку и уже далее, соединившись с другими установками, образуете целый комплекс – нефтеперерабатывающий завод 😊
""",
    6: """Наконец-то можно приступить к изучению установки!

Надеюсь, вы станете отличной командой и сможете построить свою установку и уже далее, соединившись с другими установками, образуете целый комплекс – нефтеперерабатывающий завод 😊
""",
    7: """Наконец-то можно приступить к изучению установки!

Надеюсь, вы станете отличной командой и сможете построить свою установку и уже далее соединившись с другими установками образуете целый комплекс – нефтеперерабатывающий завод 😊
""",
    8: """Наконец-то можно приступить к изучению установки!

Надеюсь, вы станете отличной командой и сможете построить свою установку и уже далее, соединившись с другими установками, образуете целый комплекс – нефтеперерабатывающий завод 😊 
""",
    9: """Наконец-то можно приступить к изучению товарного парка!

Надеюсь, вы  станете отличной командой и сможете построить товарный парк и уже далее, соединившись с другими установками, образуете целый комплекс – нефтеперерабатывающий завод 😊
"""
}

first_part_special_two = {
    0: """Школа - это учебное заведение, где получают общее образование. Это то место, где школьники проводят значительную часть своего дня. Здесь они учатся, узнают много нового и общаются друг с другом 

Давай приступим к построению школы 
""",
    1: '''Университет - это высшее учебное заведение, где происходит обучение и подготовка специалистов различных отраслей

Например сейчас ты проходишь эту игру в наикрутейшем университете - Омском государственном техническом университете, некоторые его называют "Политех"

Давай же приступим к построению одного из корпусов университета 
''',
    2: """Офис - это здание, в котором располагается компания, а также где работают ее сотрудники

Давай же приступим к построению офиса компании""",
    3: """Вам выпала честь строить одну из главных установок на заводе, без нее мы бы не смогли получить из нефти полезные нам продукты 😉

Установка атмосферно-вакуумной трубчатки (АВТ), работает как обычная перегонка. Она предназначена для разделения нефти на отдельные компоненты - фракции.
Фракции - это компоненты нефти (нефтепродукты), которые в дальнейшем обрабатываются и получают нефтепродукты.

Из АВТ выходят следующие фракции: бензиновая, керосиновая, дизельная и мазут.""",
    4: """В нефти содержатся газы - легкие углеводороды. И чтобы их извлечь и из них что-то получить, нужна газофракционирующая установка (ГФУ)

Газофракционирующая установка (ГФУ) предназначена для разделения широкой фракции легких углеводородов (ШФЛУ) на узкие фракции (индивидуальные компоненты) 

ШФЛУ - это смесь углеводородов, состоящая в основном из метана, этана, пропана, бутана, пентана и гексана с примесями более тяжелых углеводородов С6+

Газы полученные на нефтепереробатывающем заводе в дальнейшем используются для обогрева других установок, в быту (к примеру в газовой плите), отправляют на другие установки с получением высокооктанового компонента бензина. Так же из газов получают полимеры, из которых делают пластик – незаменимы атрибут в современном мире.

Давай приступим к построению газофракционирующей установки
А вот так выглядит газофракционирующая установка на реальном НПЗ.""",
    5: """К составу бензина в наше время предъявляются высокие требования! И чтобы получить высококачественный бензин, нам на заводе очень нужны установки каталитического риформинга и изомеризации

Сырьем для ваших установок являются узкие фракции бензина, различающиеся по температуре кипения углеводородов. Они получаются путем вторичной перегонки бензина (разделение широкой фракции бензина, вышедшей с установки атмосферно-вакуумной перегонки). 

С установки изомеризации мы получаем целевой продукт изомеризат, а с риформинга – риформат. Сложно перепутать их продукты, так как названия исходят от самого процесса 😅

Оба этих продукта используются как компонент бензина, но имеют различны углеводородный состав.

Давай приступим к построению установки изомеризации

А так выглядят данные установки на НПЗ. Вид реакторов в разрезе:""",
    6: """Сейчас вы узнаете, что такое гидроочистка, для чего она предназначена и почему без нее не обходится ни один НПЗ 🧐""",
    7: """Легкие компоненты нефти проще переработать, чем тяжелые. Короткие углеродные цепочки легко распадаются и превращаются в другие молекулы 

А что же делать с тяжелыми? 😬 Ведь их тоже нужно переработать во что-то полезное

Нефтяникам приходится приложить больше усилий для их переработки. Поэтому они и придумали такие процессы как каталитический крекинг и гидрокрекинг

Начнем изучать мир тяжелых углеводородов с установки каталитического крекинга

Крекинг (от англ. “crack” - расщеплять) - это процесс расщепления углеводородных цепей. Длинные и тяжелые углеродные цепочки распадаются на более легкие. Сырьем такого процесса является высокооктановый компонент бензина.

Главным продуктом данного процесса является высокооктановый компонент бензина.

И так же помимо целевого продукта на данной установке можно получить газы, дизельное топливо и такие необычные нефтепродукты как легкий и тяжелый газойль, они необходимы для многих других процессов нефтепереработки.

Каталитический крекинг один из самых необычных и запоминающихся установок. Он отличается своим реактором, у которого даже есть свое название «лифт реактор», потому что пространство, куда подается сырье похоже на лифт в высокоэтажном доме.

Давай приступим к построению установки каталитического крекинга

Вот таким интересным образом выглядят циклоны в реакторе каталитического крекинга. Похожи на висюльки или на осьминожку  🐙""",
    8: """Самые-самые тяжелые компоненты нефти (гудрон) тоже можно переработать во что-то полезное. Например, можно получить нефтяной кокс или битум

На нефтеперерабатывающем заводе есть установки для получения кокса и битума

Одна из них называется установкой замедленного коксования (УЗК).

Кокс является важнейшим сырьем в отрасли металлургии (производства алюминия) и электродной промышленности. Все электроды, которые находятся в наших телефонах, компьютерах и другой техники сделаны из нефтяного кокса.

Кокс является важнейшим сырьем в отрасли металлургии (производства алюминия) и электродной промышленности. Все электроды, которые находятся в наших телефонах, компьютерах и другой техники сделаны из нефтяного кокса.

Замедленное - потому что получение кокса может занять до 48 часов! 

Давай приступим к построению установки замедленного коксования


Битум – это углеродно-вяжущий материал, при нормальных условиях имеет твердое агрегатное состояние.

Так же битумы бывают различного назначения: дорожные – для производства асфальта, кровельные для крыши домов и строительного назначения.

Таким образом, мы можем увидеть, что из нефти можно получить не только жидкие продукты, такие как топливо, но и твердые материалы, применяемые в различных отраслях нашей жизни.

Вот так выглядит нефтяной кокс и установка по его получению – УЗК.""",
    9: """Товарный парк - территория, на которой расположены резервуары (большие емкости), в которых хранятся нефтепродукты в товарном виде перед отправкой потребителям, то есть на заправку.

Давай приступим к построению товарного парка"""
}
first_part_special_two_addon_addon_addon = {
    7: '''А вот так выглядит установка алкилирования на реальном НПЗ''',
    8: '''Установка по производству битума'''
}
first_part_special_two_addon_addon = {
    6: '''А вот так выглядит установка по производству серы на реальном НПЗ.
Давай приступим к построению блока гидроочистки и производства серы !''',
    7: '''
Процесс производства МТБЭ - это процесс получения метил-трет-бутилового эфира ,сырьем которого являются свежий метанол и бутан-бутиленовая фракция. 

Этот процесс имеет значение в производстве высокооктановых составов бензина, поскольку МТБЭ улучшает октановое число и свойства сгорания топлива.

А теперь давай рассмотрим информацию про алкилирование😎

Алкилирование - это процесс, в результате которого алкильная группа (группа углеродов и водородов) присоединяется к органическому соединению, изменяя его свойства. 

А также, в качестве высокооктановых компонентов товарных бензинов широко
используются продукты алкилирования изобутана. Эти продукты
(алкилаты) получают алкилированием изобутана некоторыми олефиновыми
углеводородами (бутиленами, пропиленом, этиленом) с использованием
жидких катализаторов. 

Давай же приступим к построению блока МТБЭ и алкилирование !''',
    8: '''Установка УЗК'''
}
first_part_special_two_addon = {
    1: '''Колледж - это место, где ты переходишь из мира школьных уроков в захватывающий мир профессионального образования! Здесь ты окажешься в центре событий, где каждый день - это шанс стать лучше, узнать что-то новое и раскрыть свой потенциал.''',
    2: '''В Учебном Центре Омского НПЗ ты сможешь не только учиться, но и создавать. С помощью лабораторных работ, творческих проектов и исследовательской работы ты сможешь применить свои знания на деле, делая уроки интересными и запоминающимися. Здесь ты найдешь друзей с аналогичными интересами, с которыми вместе погружаешься в увлекательные занятия и исследования.
''',
    3: '''Бензин используется для топлива автомобилей, дизельное топливо для сельскохозяйственной, тихоходной техники и некоторых автомобиле. А для чего же керосин, если керосиновые лампы больше не используют? А керосиновая фракция используется для производства реактивного топлива, на котором летают самолеты и ракеты.

Вакуумная перегонка необходима для того переработать мазут – темную масляную жидкость, в светлыеинефтепродукты. Проводить данный процесс необходимо под вакуумом (очень пониженном давлении), так как при обычном давлении мазут может загустеть и превратиться в кокс – темный твердый нефтепродукт, похожий на камушки.

Давай приступим к построению блока атмосферной перегонки нефти

А вот так выглядит данная установка на заводе. Множество теплообменников и колонн для переработки нефти.''',
    5: '''Каталитическая измеризация''',
    6: '''Куда же девается сероводород после гидроочистки ? Давай же я тебе расскажу!

Из-за высокого содержания серы могуть быть последствия : плохое воздействие на мотор и может быть вызвана даже сильная коррозия.

Однако,есть такой процесс Клаусса. Это метод производства серы, который используется для превращения сероводорода (H2S), содержащегося в отходных газах различных производств, обычно при производстве серной кислоты, в элементарную серу.

Производство серы имеет большое значение, поскольку позволяет использовать сероводород, обычно рассматриваемый ,как вредный и иногда необходимый для особых методов обработки, для производства полезного продукта, такого как сера.

Давай приступим к построению блока гидроочистки и производства серы !
''',
    7: '''А вот так выглядит установка каталитического крекинга на реальном НПЗ.''',
    8: '''А вот так выглядит битум и установка по его получению.''',
    9: '''Добро пожаловать в учебную лабораторию, где звучат шорохи страниц учебников и жужжание научных дискуссий. Здесь, среди стен с плакатами химических формул и стеллажей с инструментами, начинается ваше научное приключение.

Здесь возможно все: провести химический анализ, исследовать микроструктуру материалов под микроскопом, изучать физические законы на практике. Лабораторные работы становятся возможностью не только проверить свои знания, но и открыть для себя новые связи между теорией и реальными явлениями.

А для чего нужны лаборатории на заводе? Все слышали про такое слово как «ГОСТ» —это стандарт, по которому выпускается множество продукции. Бывает ГОСТ на колбасу, на сгущенку и множество других вещей и нефтепродукты не исключение. Чтобы понять, что завод выпускает качественный товар, необходимо сверить его с единым стандартом по ГОСТу. Этим и занимаются лаборанты химического анализа в лаборатории, и этому обучаются студенты в университетах. 

В лаборатории для студентов каждый эксперимент — это шанс пройти через портал знаний и ощутить себя исследователем, искателем правды в мире науки! 🧪🔬📚'''}

# ----------------------------------------------------------------------------------------------------------------------------------------------
# Изменения для 30 марта

first_part_special_three_new = {
    0: """Первым делом найди акриловую конструкцию 

С одной стороны на ней изображено внешнее строение здания, а с другой стороны - внутреннее
""",
    1: """Первым делом найди акриловую конструкцию 

С одной стороны на ней изображено внешнее строение здания, а с другой стороны - внутреннее
""",
    2: """Первым делом найди акриловую конструкцию 

С одной стороны на ней изображено внешнее строение здания, а с другой стороны - внутреннее
""",
    3: """Первым делом найди акриловую конструкцию 

С одной стороны на ней изображено внешнее строение установки, а с другой стороны - внутреннее
""",
    4: """Первым делом найди акриловую конструкцию 

С одной стороны на ней изображено внешнее строение установки, а с другой стороны - внутреннее
""",
    5: """Первым делом найди акриловую конструкцию 

С одной стороны на ней изображено внешнее строение установки, а с другой стороны - внутреннее
""",
    6: """Первым делом найди акриловую конструкцию 

С одной стороны на ней изображено внешнее строение установки, а с другой стороны - внутреннее
""",
    7: """Первым делом найди акриловую конструкцию 

С одной стороны на ней изображено внешнее строение установки, а с другой стороны - внутреннее
""",
    8: """Первым делом найди акриловую конструкцию 

С одной стороны на ней изображено внешнее строение установки, а с другой стороны - внутреннее
""",
    9: """Первым делом найди акриловую конструкцию

С одной стороны на ней изображено внешнее строение товарного парка, а с другой стороны - внутреннее
"""
}

first_part_special_pass_new = {
    0: """Для продолжения игры напиши секретный код, который размещен на подставке акриловой таблички""",
    1: """Для продолжения игры напиши секретный код, который размещен на подставке акриловой таблички""",
    2: """Для продолжения игры напиши секретный код, который размещен на подставке акриловой таблички""",
    3: """Для продолжения игры напиши секретный код, который размещен на подставке акриловой таблички""",
    4: """Для продолжения игры напиши секретный код, который размещен на подставке акриловой таблички""",
    5: """Для продолжения игры напиши секретный код, который размещен на подставке акриловой таблички""",
    6: """Для продолжения игры напиши секретный код, который размещен на подставке акриловой таблички""",
    7: """Для продолжения игры напиши секретный код, который размещен на подставке акриловой таблички""",
    8: """Для продолжения игры напиши секретный код, который размещен на подставке акриловой таблички""",
    9: """Для продолжения игры напиши секретный код, который размещен на подставке акриловой таблички""",
}

first_part_special_pass_new_answer = {
    0: """Даа, этот код подходит! 💯

А теперь пришло время для наклеек!
 
В наборе есть наклейки с надписью “Университет”. Приклей их над изображением здания университета""",
    1: """Даа, этот код подходит! 💯

А теперь пришло время для наклеек!
 
В наборе есть наклейки с надписью “Офис компании”. Приклей их над изображением здания офиса компании
""",
    2: """Даа, этот код подходит! 💯

А теперь пришло время для наклеек!
 
В наборе есть наклейка с надписью “Атмосферный блок”. Приклей ее на левую часть основания макета 
""",
    3: """Даа, этот код подходит! 💯

А теперь пришло время для наклеек!
 
В наборе есть наклейка с надписью “Газофракционирующая установка”. Приклей ее на основание макета 
""",
    4: """Даа, этот код подходит! 💯

А теперь пришло время для наклеек!
 
В наборе есть наклейка с надписью “Установка изомеризации”. Приклей ее на левую часть основания макета 
""",
    5: """Даа, этот код подходит! 💯

А теперь пришло время для наклеек!
 
В наборе есть наклейка с надписью “Установка гидроочистки”. Приклей ее на основание макета
""",
    6: """Даа, этот код подходит! 💯

А теперь пришло время для наклеек!
 
В наборе есть наклейка с надписью “Установка каталитического крекинга”. Приклей ее на левую часть основания макета
""",
    7: """Даа, этот код подходит! 💯

А теперь пришло время для наклеек!
 
В наборе есть наклейка “Установка замедленного коксования”. Приклей ее на левую часть основания макета
""",
    8: """Даа, этот код подходит! 💯

А теперь пришло время для наклеек!
 
В наборе есть наклейка с надписью “Товарный парк ”. Приклей ее на основание макета 
""",
    9: """Даа, этот код подходит! 💯

А теперь пришло время для наклеек!
 
В наборе есть наклейки с надписью “Школа”. Приклейте их над изображением здания школы
""",
}

first_part_special_four_new = {
    0: """Тогда продолжаем! 💯

А теперь пришло время для наклеек!

В наборе есть наклейки с надписью “Школа”. Приклейте их над изображением здания школы
""",
    1: """Тогда продолжаем! 💯!

А теперь пришло время для наклеек!

В наборе есть наклейки с надписью «Университет». Приклей их над изображением здания университета
""",
    2: """Тогда продолжаем! 💯

А теперь пришло время для наклеек!

В наборе есть наклейки с надписью “Офис компании”. Приклей их над изображением здания офиса компании
""",
    3: """Тогда продолжаем! 💯

А теперь пришло время для наклеек!

В наборе есть наклейки с надписью “Установка атмосферно-вакуумной перегонки”. Приклей их над изображением установки атмосферно-вакуумной перегонки
""",
    4: """Тогда продолжаем! 💯

А теперь пришло время для наклеек!

В наборе есть наклейки с надписью “Газофракционирующая установка”. Приклей их над изображением газофракционирующей установки
""",
    5: """Тогда продолжаем! 💯

А теперь пришло время для наклеек!

В наборе есть наклейки с надписью “Установка изомеризации, установка каталитического риформинга”. Приклей их над изображением установки изомеризации и установки каталитического риформинга
""",
    6: """Тогда продолжаем! 💯

А теперь пришло время для наклеек!

В наборе есть наклейки с надписью “Установка гидроочистки, установка производства серы”. Приклей их над изображением установки гидроочистки и установки производства серы
""",
    7: """Тогда продолжаем! 💯

А теперь пришло время для наклеек!

В наборе есть наклейки с надписью “Установка каталитического крекинга и гидрокрекинга, установка производства МТБЭ, установка алкилирования”. Приклей их над изображением установки каталитического крекинга и гидрокрекинга, установки производства МТБЭ и установки алкилирования
""",
    8: """Тогда продолжаем! 💯

А теперь пришло время для наклеек!

В наборе есть наклейки с надписью “Установка замедленного коксования, установка производства нефтяного битума”. Приклей их над изображением установки замедленного коксования и установки производства нефтяного битума
""",
    9: """Тогда продолжаем! 💯

А теперь пришло время для наклеек!

В наборе есть наклейки с надписью “Товарный парк и лаборатория”. Приклей их над изображением товарного парка и лаборатории
""",
}

first_part_special_six_new = {
    0: """А еще здесь есть разные наклейки, которые тоже надо будет приклеить на ваше здание. Но о них расскажу чуть позже 🤫""",
    1: """А еще здесь есть разные наклейки, которые надо будет приклеить на ваше здание. Но о них расскажу чуть позже 🤫""",
    2: """А еще здесь есть разные наклейки, которые тоже надо будет приклеить на ваш блок. Но о них расскажу чуть позже 🤫""",
    3: """А еще здесь есть разные наклейки, которые тоже надо будет приклеить на вашу установку. Но о них расскажу чуть позже 🤫  """,
    4: """А еще здесь есть разные наклейки, которые тоже надо будет приклеить на ваше здание. Но о них расскажу чуть позже 🤫""",
    5: """А еще здесь есть разные наклейки, которые надо будет приклеить на вашу установку. Но о них расскажу чуть позже 🤫""",
    6: """А еще здесь есть разные наклейки, которые тоже надо будет приклеить на установку. Но о них расскажу чуть позже 🤫""",
    7: """А еще здесь есть разные наклейки, которые тоже надо будет приклеить на вашу установку. Но о них расскажу чуть позже 🤫""",
    8: """А еще здесь есть разные наклейки, которые тоже надо будет приклеить. Но о них расскажу чуть позже 🤫""",
    9: """А еще здесь есть разные наклейки, которые тоже надо будет приклеить. Но о них расскажу чуть позже 🤫""",
}
first_part_special_seven_new = {
    0: """Сейчас я отправлю твоей команде теорию. Не забудь ее записать! ✍️""",
    1: """Сейчас я отправлю твоей команде теорию. Не забудь ее записать! ✍️""",
    2: """Сейчас я отправлю твоей команде теорию. Не забудь ее записать! ✍️""",
    3: """Сейчас я отправлю твоей команде теорию. Не забудь ее записать! ✍️""",
    4: """Сейчас я отправлю твоей команде теорию. Не забудь ее записать! ✍️""",
    5: """Сейчас я отправлю твоей команде теорию. Не забудь ее записать! ✍️""",
    6: """Сейчас я отправлю твоей команде теорию. Не забудь ее записать! ✍️""",
    7: """Сейчас я отправлю твоей команде теорию. Не забудь ее записать! ✍️""",
    8: """Сейчас я отправлю твоей команде теорию. Не забудь ее записать! ✍️""",
    9: """Сейчас я отправлю твоей команде теорию. Не забудь ее записать! ✍️""",
}
first_part_special_twelve_new = {
    0: """У вас осталась еще одна акриловая конструкция!

Приклей на нее наклейки с надписью «Дом творчества» и используй другие наклейки
""",
    1: """У вас осталась еще одна акриловая конструкция!

Приклей на нее наклейки с надписью “Колледж” и используй другие наклейки
""",
    2: """Оставшиеся наклейки с названиями подразделений компании приклей на соответствующие им этажи

Одно из подразделений может показаться незнакомым. Я еще не успел рассказать о нем
""",
    3: """У вас еще остались акриловые конструкции!

Приклей на правую часть основания макета наклейку с надписью “Вакуумный блок” и используй другие наклейки
""",
    4: """А также у вас есть наклейки с рисунками

Например, рядом с потоком углеводородов пентан и выше (С5+) приклейте изображение автомобиля

И не забудьте использовать другие наклейки
""",
    5: """У вас еще остались акриловые конструкции!

Приклей на правую часть основания макета наклейку с надписью “Установка каталитического риформинга” и используй другие наклейки
""",
    6: """А также у вас есть наклейки с рисунками

Например, рядом с потоком сероводорода (отходит с самого верха колонны) приклейте изображение молекулы сероводорода

И не забудьте использовать другие наклейки
""",
    7: """У вас еще остались акриловые конструкции!

Приклей на правую часть основания макета наклейку “Установка гидрокрекинга” и используй другие наклейки
""",
    8: """У тебя еще остались акриловые конструкции!

Приклей на правую часть основания макета наклейку “Установка производства нефтяного битума” и используй другие наклейки
""",
    9: """У вас еще остались акриловые конструкции!

Приклей на них наклейки
""",
}
# ----------------------------------------------------------------------------------------------------------------------------------------------

first_part_special_three = {
    0: 'Первым делом собери кубики из картонных заготовок, которые лежат у вас на столе'
       '\n\nТаких кубиков у твоей команды получится целых 12! 🫢'
       '\n\nДля здания университета вам понадобится 6 кубиков. Соедините их вместе как на картинке ниже'
       '\n\nБудьте аккуратны и внимательны. У вас должна получиться ровная поверхность  ',
    1: """Первым делом собери кубики из картонных заготовок, которые лежат у вас на столе

Таких кубиков у твоей команды получится целых 6 штук! 🫢

Для офиса компании вам понадобятся все 6 кубиков. Соедините их вместе как на картинке ниже

Будьте аккуратны и внимательны. У вас должна получиться ровная поверхность""",
    2: """Первым делом собери кубики из картонных заготовок, которые лежат у вас на столе

Таких кубиков у твоей команды получится целых 36! 🫢

Для атмосферного блока вам понадобится 20 кубиков. Соедините их вместе как на картинке ниже

Будьте аккуратны и внимательны. У вас должна получиться ровная поверхность  """,
    3: """Первым делом собери кубики из картонных заготовок, которые лежат у вас на столе

Таких кубиков у твоей команды получится целых 20 штук! 🫢

Для газофракционирующей установки вам понадобятся все 20 кубиков. Соедините их вместе как на картинке ниже

Будьте аккуратны и внимательны. У вас должна получиться ровная поверхность  """,
    4: """Первым делом собери кубики из картонных заготовок, которые лежат у вас на столе

Таких кубиков у твоей команды получится целых 50! 🫢

Для установки изомеризации вам понадобится 25 кубиков. Соедините их вместе как на картинке ниже

Будьте аккуратны и внимательны. У вас должна получиться ровная поверхность""",
    5: """Первым делом собери кубики из картонных заготовок, которые лежат у вас на столе

Таких кубиков у твоей команды получится целых 16! 🫢

Для установки гидроочистки вам понадобятся все 16 кубиков. Соедините их вместе как на картинке ниже

Будьте аккуратны и внимательны. У вас должна получиться ровная поверхность""",
    6: """Первым делом собери кубики из картонных заготовок, которые лежат у вас на столе

Таких кубиков у твоей команды получится целых 45! 🫢

Для установки каталитического крекинга вам понадобится 25 кубиков. Соедините их вместе как на картинке ниже

Будьте аккуратны и внимательны. У вас должна получиться ровная поверхность""",
    7: """Первым делом собери кубики из картонных заготовок, которые лежат у вас на столе

Таких кубиков у твоей команды получится целых 32! 🫢

Для установки замедленного коксования вам понадобится 16 кубиков. Соедините их вместе как на картинке ниже

Будьте аккуратны и внимательны. У вас должна получиться ровная поверхность 
""",
    8: """Первым делом собери кубики из картонных заготовок, которые лежат у вас на столе

Таких кубиков у твоей команды получится целых 30! 🫢

Для товарного парка вам понадобится 10 кубиков. Соедините их вместе как на картинке ниже

Будьте аккуратны и внимательны. У вас должна получиться ровная поверхность 
""",
    9: """Первым делом собери кубики из картонных заготовок, которые лежат у вас на столе

Таких кубиков у твоей команды получится целых 12! 🫢

Для школы вам понадобится 6 кубиков. Соедините их вместе как на картинке ниже

Будьте аккуратны и внимательны. У вас должна получиться ровная поверхность  
"""
}

first_part_special_four = {
    0: 'Круто, вы собрали каркас здания!'
       '\n\nА теперь найди лист бумаги №1, на нем изображен университет '
       '\n\nВы будете приклеивать эти листы на ваш каркас из коробочек'
       '\n\nСначала вырежьте по пунктирным линиям здание. А затем аккуратно приклейте его на ваш каркас '
       '\n\nУ вас получится здание университета!',
    1: """Круто, вы собрали каркас здания!

А теперь найди лист бумаги №3, на нем изображен офис

Вы будете приклеивать эти листы на ваш каркас из коробочек

Сначала вырежьте по пунктирным линиям здание. А затем аккуратно приклейте его на ваш каркас 

У вас получится здание офиса компании
""",
    2: """Круто, вы собрали каркас для блока установки!

А теперь найди лист бумаги №4, на нем изображен блок атмосферной перегонки нефти

Вы будете приклеивать эти листы на ваш каркас из коробочек

Сначала вырежьте по пунктирным линиям установку. А затем аккуратно приклейте ее на ваш каркас 

У вас получится часть вашей установки!
""",
    3: """Круто, вы собрали каркас установки!

А теперь найди лист бумаги №6, на нем изображена ГФУ

Вы будете приклеивать эти листы на ваш каркас из коробочек

Сначала вырежьте по пунктирным линиям установку. А затем аккуратно приклейте ее на ваш каркас 

И у вас получится газофракционирующая установка!
""",
    4: """Круто, вы собрали каркас установки!

А теперь найди лист бумаги №7, на нем изображена установка изомеризации

Вы будете приклеивать эти листы на ваш каркас из коробочек

Сначала вырежьте по пунктирным линиям установку. А затем аккуратно приклейте ее на ваш каркас 

У вас получится установка изомеризации! 
""",
    5: """Круто, вы собрали каркас установки!

А теперь найди лист бумаги №9, на нем изображена установка гидроочистки

Вы будете приклеивать эти листы на ваш каркас из коробочек

Сначала вырежьте по пунктирным линиям установку. А затем аккуратно приклейте ее на ваш каркас 

У вас получится установка гидроочистки! 
""",
    6: """Круто, вы собрали каркас установки!

А теперь найди лист бумаги №10, на нем изображена установка каталитического крекинга

Вы будете приклеивать эти листы на ваш каркас из коробочек

Сначала вырежьте по пунктирным линиям установку. А затем аккуратно приклейте ее на ваш каркас 

У вас получится установка каталитического крекинга! 
""",
    7: """Круто, вы собрали каркас установки!

А теперь найди лист бумаги №12, на нем изображена установка замедленного коксования

Вы будете приклеивать эти листы на ваш каркас из коробочек

Сначала вырежьте по пунктирным линиям установку. А затем аккуратно приклейте ее на ваш каркас 

У вас получится установка замедленного коксования!""",
    8: """Круто, вы собрали каркас товарного парка!

А теперь найди лист бумаги №14, на нем изображен товарный парк

Вы будете приклеивать эти листы на ваш каркас из коробочек

Сначала вырежьте по пунктирным линиям товарный парк. А затем аккуратно приклейте его на ваш каркас 

У вас получится товарный парк! 
""",
    9: """Круто, вы собрали каркас школы!

А теперь найди лист бумаги №17, на нем изображена школа

Вы будете приклеивать эти листы на ваш каркас из коробочек

Сначала вырежьте по пунктирным линиям школу. А затем аккуратно приклейте ее на ваш каркас 

У вас получится школа! 
"""
}

first_part_special_five = {
    0: """Ребята, а у вас собралась классная команда! 😎

Если у вас есть какие-то вопросы, спрашивайте у моих помощников - организаторов

И не забывайте работать в команде, так вы справитесь с заданием быстрее 😊
""",
    1: """Ребята, а у вас собралась классная команда! 😎 

Если у вас есть какие-то вопросы, спрашивайте у моих помощников - организаторов

И не забывайте работать в команде, так вы справитесь с заданием быстрее 😊
""",
    2: """Ребята, а у вас собралась классная команда! 😎

Если у вас есть какие-то вопросы, спрашивайте у моих помощников - организаторов

И не забывайте работать в команде, так вы справитесь с заданием быстрее 😊
""",
    3: """Ребята, а у вас собралась классная команда! 😎 

Если у вас есть какие-то вопросы, спрашивайте у моих помощников - организаторов

И не забывайте работать в команде, так вы справитесь с заданием быстрее 😊
""",
    4: """Ребята, а у вас собралась классная команда! 😎 

Если у вас есть какие-то вопросы, спрашивайте у моих помощников - организаторов

И не забывайте работать в команде, так вы справитесь с заданием быстрее 😊
""",
    5: """Ребята, а у вас собралась классная команда! 😎 

Если у вас есть какие-то вопросы, спрашивайте у моих помощников - организаторов

И не забывайте работать в команде, так вы справитесь с заданием быстрее 😊
""",
    6: """Ребята, а у вас собралась классная команда! 😎 

Если у вас есть какие-то вопросы, спрашивайте у моих помощников - организаторов

И не забывайте работать в команде, так вы справитесь с заданием быстрее 😊
""",
    7: """Ребята, а у вас собралась классная команда! 😎 

Если есть какие-то вопросы, спрашивайте у моих помощников - организаторов

И не забывайте работать в команде, так вы справитесь с заданием быстрее 😊
""",
    8: """Ребята, а у вас собралась классная команда! 😎 

Если у вас есть какие-то вопросы, спрашивайте у моих помощников - организаторов

И не забывайте работать в команде, так вы справитесь с заданием быстрее 😊
""",
    9: """Ребята, а у вас собралась классная команда! 😎 

Если у вас есть какие-то вопросы, спрашивайте у моих помощников - организаторов

И не забывайте работать в команде, так вы справитесь с заданием быстрее 😊
"""
}

first_part_special_six = {
    0: ' А теперь пришло время для наклеек'
       '\n\nВ наборе есть наклейка с надписью “Университет”. Приклейте ее сверху на здание университета'
       '\n\nА еще здесь есть разные наклейки, которые тоже надо будет приклеить на ваше здание. Но о них расскажу чуть позже 🤫',
    1: """А теперь пришло время для наклеек
 
В наборе есть наклейка с надписью “Офис компании”. Приклейте ее сверху на кубик

А еще здесь есть разные наклейки, которые надо будет приклеить на ваше здание. Но о них расскажу чуть позже 🤫
""",
    2: """ А теперь пришло время для наклеек
 
В наборе есть наклейка с надписью “Атмосферный блок”. Приклейте ее сверху на ваш собранный блок

А еще здесь есть разные наклейки, которые тоже надо будет приклеить на ваше здание. Но о них расскажу чуть позже 🤫
""",
    3: """А теперь пришло время для наклеек
 
В наборе есть наклейка с надписью “Газофракционирующая установка”. Приклейте ее сверху на кубик

А еще здесь есть разные наклейки, которые надо будет приклеить на вашу установку. Но о них расскажу чуть позже 🤫
""",
    4: """А теперь пришло время для наклеек
 
В наборе есть наклейка с надписью “Установка изомеризации”. Приклейте ее сверху на вашу установку

А еще здесь есть разные наклейки, которые тоже надо будет приклеить на установку. Но о них расскажу чуть позже 🤫
""",
    5: """А теперь пришло время для наклеек
 
В наборе есть наклейка с надписью “Установка гидроочистки”. Приклейте ее сверху на кубик

А еще здесь есть разные наклейки, которые надо будет приклеить на вашу установку. Но о них расскажу чуть позже 🤫
""",
    6: """А теперь пришло время для наклеек
 
В наборе есть наклейка с надписью “Установка каталитического крекинга”. Приклейте ее сверху на вашу установку

А еще здесь есть разные наклейки, которые тоже надо будет приклеить на установку. Но о них расскажу чуть позже 🤫""",
    7: """А теперь пришло время для наклеек
 
В наборе есть наклейка с надписью “Установка замедленного коксования”. Приклейте ее сверху на установку

А еще здесь есть разные наклейки, которые тоже надо будет приклеить на вашу установку. Но о них расскажу чуть позже 🤫
""",
    8: """А теперь пришло время для наклеек
 
В наборе есть наклейка с надписью “Товарный парк”. Приклейте ее сверху на ваш товарный парк

А еще здесь есть разные наклейки, которые тоже надо будет приклеить. Но о них расскажу чуть позже 🤫
""",
    9: """А теперь пришло время для наклеек
 
В наборе есть наклейка с надписью “Школа”. Приклейте ее сверху на ваше здание

А еще здесь есть разные наклейки, которые тоже надо будет приклеить. Но о них расскажу чуть позже 🤫
"""
}

first_part_special_seven = {
    0: 'Сейчас я отправлю твоей команде теорию. Не забудьте ее записать! ✍️',
    1: 'Сейчас я отправлю твоей команде теорию. Не забудьте ее записать! ✍️',
    2: 'Сейчас я отправлю твоей команде теорию. Не забудьте ее записать! ✍️',
    3: 'Сейчас я отправлю твоей команде теорию. Не забудьте ее записать! ✍️',
    4: 'Сейчас я отправлю твоей команде теорию. Не забудьте ее записать! ✍️',
    5: 'Сейчас я отправлю твоей команде теорию. Не забудьте ее записать! ✍️',
    6: 'Сейчас я отправлю твоей команде теорию. Не забудьте ее записать! ✍️',
    7: 'Сейчас я отправлю твоей команде теорию. Не забудьте ее записать! ✍️',
    8: 'Сейчас я отправлю твоей команде теорию. Не забудьте ее записать! ✍️',
    9: 'Сейчас я отправлю твоей команде теорию. Не забудьте ее записать! ✍️'
}

first_part_special_eight = {
    0: '''У ребят, которые учатся в школе, часто появляется вопрос «В каком направлении продолжить обучение и чем заниматься дальше?»

Чтобы помочь школьникам выбрать подходящую профессию в соответствии с их талантами и склонностями, существуют профориентационные проекты

Такие программы действуют при содействии промышленных предприятий

Одно из таких предприятий, которые помогают школьникам и делают для нихмного полезного - "Газпромнеть ОНПЗ"''',
    1: '''В университете ребята слушают лекции, приходят на семинары и лабораторные занятия, узнают много нового, знакомятся с интересными людьми и общаются друг с другом

В здании университета расположены аудитории, где студенты учатся. Также здесь есть конференц-зал, в котором проводятся торжественные заседания и научные конференции

Университет включает в себя разные факультеты и институты, каждый из которых подразделяется на кафедры

В университете проводятся ярмарки вакансий. Давай узнаем подробнее, что это такое 🤔

На ярмарке вакансий можно встретить компании из разных регионов, где студенты могут лично пообщаться с потенциальными работодателями и задать вопросы

Специалисты кадровой службы рассказывают о корпоративной культуре компании, возможностях прохождения практики и дальнейшего трудоустройства

Для учащихся ярмарка вакансий – возможность начать карьеру в компании, а для компании – способ найти перспективных специалистов различного профиля: инженеров, механиков, технологов, программистов, экономистов
''',
    2: """Вы собрали офис компании!

У традиционного офиса есть физическое расположение. Наш офис расположился в многоэтажном здании

Структурно офис компании состоит из разных отделов

В нашем офисе располагается отдел развития персонала

Что это за отдел такой? Давайте я вам расскажу

Отдел развития персонала - это такая структура в компании, которая занимается управлением персонала

Отдел развития персонала обеспечивает предприятие необходимыми кадрами и эффективно использует потенциал работников

Так, например, они подают информацию о вакансиях

Сотрудники этого отдела взаимодействуют со всеми подразделениями компании. Они помогают другим работникам при обучении, аттестации, повышении квалификации

Также они помогают сотрудникам других отделов адаптироваться на работе

Что же делают сотрудники отдела развития персонала?

- определяют потребности организации в кадрах и подбирают персонал вместе с руководителями подразделений
- организуют аттестацию сотрудников
- подготавливают планы повышения квалификации сотрудников
- организуют обучение сотрудников
- занимаются подготовкой проведения корпоративных мероприятий для сотрудников

Отдел развития персонала ответственен за личностный рост сотрудников
""",
    3: """Итак, нефть приходит на завод и разделяется на части (фракции) на установке атмосферно-вакуумной перегонки. А еще эту установку называют атмосферно-вакуумная трубчатка (АВТ), потому что нефть греется в трубчатых печах (которая состоит из множества труб) перед тем как разделиться

Нефть поступает в первую очередь на атмосферный блок, а потом уже на вакуумный

Но вам нужно узнать еще кое-что! Нефть с месторождений содержит ненужные соли и лишнюю воду, которые в дальнейшем могут мешать нормальной работе аппаратов. Например, вызывать коррозию металла, из которого построены почти все объекты завода
Поэтому сначала нефть отправляют на электрообессоливающую установку (ЭЛОУ)
""",
    4: """На газофракционирующую установку поступают газы (ШФЛУ) с установок - атмосферно-вакуумной перегонки, каталитического риформинга, изомеризации, гидрокрекинга, каталитического крекинга (эта информация вам ещё пригодится в дальнейшем этапе строительства завода)

Разделение смесей газов (углеводородов) осуществляется в колоннах

Колонны - это такие высокие металлические вертикальные цилиндрические аппараты

Высота колонны может превышать 50 м! Это примерно как 15-ти этажное здание
""",
    5: """Пора познакомить вас с одним очень важным понятием в нефтепереработке

ОКТАНОВОЕ ЧИСЛО ⛽

Октановое число (ОЧ) - мера детонационной стойкости топлива

Давайте скажем проще

Если детонация - это взрывообразное горение, то детонационная стойкость это значит стойкость к этому горению

То есть нам нужно, чтобы топливо в автомобилях как можно дольше не воспламенялось само по себе

Чем выше детонационная стойкость, то есть чем выше октановое число, тем качественнее бензин для автомобилей ☝️

Но вот незадача, у бензина с атмосферно-вакуумной установки низкое октановое число (50-60 пунктов), а для товарного бензина октановое число должно быть выше 90

Я уверен, что вы видели на автомобильных заправках надписи на табло “АИ-92”  или “АИ-95”

92 и 95 - это октановое число, 
А - автомобильный, 
И - исследовательский (исследовательский метод, которым определяют октановое число у бензина)

Итак, каким образом повысить октановое число бензина? 

Читайте внимательно 🤓

Давайте вспомним, что нефть - это смесь различных углеводородов. А каких именно? 🧐

В нефти много предельных углеводородов (алканов) с линейной структурой, потому что они мало реакционноспособные

Следовательно, в бензине, полученном из нефти, содержится тоже много алканов, поэтому у него низкое октановое число

У каких же углеводородов высокое октановое число? У разветвленных (различных изомеров), непредельных (алкенов), ароматических (аренов) углеводородов

Получается, что в бензине должны быть именно эти компоненты

Задача установок по производству бензина выпустить топливо именно с таким составом, чтобы повысить октановое число до требуемого

Итак, установка изомеризации решает эту проблему тем, что позволяет получить из линейных алканов в бензине изомеры, разветвленные алканы. Сам процесс называется ИЗОМЕРИЗАЦИЯ
""",
    6: """Перед тем как узнать определение данной установки давайте посмотрим на само слово “Гидроочистка”

Как мы видим, оно состоит из двух  частей:
1 - это “гидро-”
2 - это “очистка”

Со словом “очистка” все понятно, а что же с приставкой “гидро-”?

Из школьного курса химии вы знаете,что “гидро” - это обозначение водорода

Теперь становится понятно что гидроочистка - это  процесс очистки чего-то водородом, а более точно

Гидроочистка -  это очистка нефтепродуктов от сернистых (преимущественно), азотистых и кислородсодержащих соединений при помощи молекул водорода, за счет чего улучшается качество топлива

Давайте посмотрим основную реакцию, которая протекает в реакторе
""",
    7: """Пример реакции крекинга показан на картинке

При крекинге молекулы расщепляются  хаотично, то есть необязательно ровно посередине

И мы не можем получить углеводород заданного строения, так как молекулы обычно имеют линейное строение, а значит низкое октановое число

Но если подобрать специальный катализатор, то можно получить углеводород нужной структуры, тогда такой процесс будет называться каталитическим крекингом
""",
    8: '''Кокс получают из самого тяжелого компонента нефти - гудрона. Гудрон поступает с установки атмосферно-вакуумной перегонки

Итак, коксование – это процесс переработки нефти через нагревание, без доступа воздуха, при котором в качестве одного из продуктов получается твердый остаток-кокс 

Битум получают различными методами. Один из самых популярных, используемый на отечественных НПЗ, это окисление гудрона кислородом, за счет чего при высоких температурах получается битум.''',
    9: """В резервуары товарного парка поступают продукты с установок переработки нефти

На нашем заводе выпускаются следующие товарные нефтепродукты:

1️⃣ компоненты товарного бензина: изомеризат (с установки изомеризации), риформат (с установки каталитического риформинга) и катализат (с установки каталитического крекинга);

2️⃣ дизельное топливо с установки гидрокрекинга;

3️⃣ дизельное топливо и керосин с установки гидроочистки
"""
}

first_part_special_eight_addon = {
    6: '''Сера — химический элемент с атомным номером 16, который также может быть обнаружен в природе в виде минерала с сероуглеродными соединениями, такими как пирит и галенит.

Серные котлы, используемые в производстве серы, являются критически важными устройствами для обеспечения безопасности и эффективности процесса.

Производство серы напрямую связано с производством серной кислоты, которая широко используется в промышленности для различных процессов и продуктов.

Производство серы является важной отраслью промышленности с использованием ресурсов природы для получения широкого спектра продуктов, необходимых для различных областей промышленности и сельского хозяйства. Однако необходим контроль за выбросами и использование технических решений для минимизации отрицательного воздействия на окружающую среду в процессе производства.

Где же может быть использвана сера? Это не проблема, давай я тебе расскажу🤓

Полученная сера может быть использована в различных отраслях промышленности, таких как химическая, нефтегазовая, сельское хозяйство, для производства удобрений, шин, лекарственных препаратов и многих других продуктов.
''',
    7: '''Детонация — это взрывной процесс горения смеси топлива и окислителя внутри двигателя или других систем. Детонация является нежелательным явлением в двигателях внутреннего сгорания, таких как двигатели внутреннего сгорания, и может привести к повреждениям двигателя и ухудшению его производительности💣

МТБЭ используется в качестве антидетонационного (антиноктюрнотного) добавки к бензину для повышения октанового числа. Это помогает предотвратить детонацию и повысить эффективность двигателя.

МТБЭ используется в качестве антидетонационного (антиноктюрнотного) добавки к бензину для повышения октанового числа. Это помогает предотвратить детонацию и повысить эффективность двигателя.Также применяется в качестве хорошо растворимого растворителя для различных органических соединений. Он может использоваться в производстве пластмасс, красок, клеев и других продуктов.

Производство МТБЭ на НПЗ - это сложный итехнологический процесс, требующий строгого контроля качества, безопасности и соблюдения всех необходимых норм и стандартов для производства этого важного компонента бензина!

Давай теперь немного теории про алкилирование😊

Алкилирование — это химическая реакция, в ходе которой к атому водорода или группе водородов в молекуле органического соединения добавляется алкильная группа — углеводородная группа, состоящая из алкильных радикалов. Алкилирование имеет большое значение в органическом синтезе.

Введение алкильной группы может увеличить стабильность молекулы к различным химическим и физическим воздействиям.
Алкилирование используется в процессе каталитического крекинга для увеличения качества бензина и повышения его октанового числа в нефтепереработке.
''',

}
first_part_special_nine_addon = {
    5: '''Риформинг – получение ароматических углеводородов из углеводородов линейной структуры.

Одна из реакций риформинга:''',
    7: '''Суть реакции алкилирования – получение более разветвленных углеводородов из бензола или его гомологов. Типовая реакция с получением кумола (изопропилбензола):'''
}

first_part_special_nine = {
    0: '''В школе ребята получают много информации. И у них проявляется интерес к определенным школьным предметам

Например, это может быть химия, физика или математика. Так ребята, которые интересуются техническими дисциплинами, могут дополнительно участвовать в различных проектах предприятий

Например, у Газпромнефть-ОНПЗ таких событий множество, и они проходят на протяжении всего учебного года
''',
    1: '''Твоя команда построила Омский государственный технический университет (ОмГТУ)

Давай узнаем, на каких специальностях можно учиться, чтобы устроиться на работу на нефтеперерабатывающий завод

1️⃣ Направление 18.03.01 «Химическая технология»
Профиль подготовки: «Химическая технология органических веществ»

Это направление отлично подойдет тем, кто любит химию и сдает по ней ЕГЭ
После обучения можно получить наикрутейшую профессию под названием "Оператор технологической установки" или "Лаборант"

2️⃣ Направление 15.03.02 «Технологические машины и оборудование»
Профиль подготовки: «Машины и аппараты химических производств» 

Это направление отлично подойдет тем, кто любит физику и сдает по ней ЕГЭ
После обучения можно получить наикрутейшую профессию под названием "Машинист компрессорной установки" 

''',
    2: """Давай представим ситуацию. Выпускник вуза находится в поиске работы

И вот он находит вакансию и откликается на нее, отправив резюме. В этот момент он является соискателем. Соискатель - это человек, который претендует на определенную должность

И когда соискатель подходит по критериям, которые важны для данной должности, то его приглашают на собеседование

И это первое взаимодействие с отделом развития персонала 

Это взаимодействие начинается при знакомстве с организацией и продолжается на протяжении всего рабочего процесса
""",
    3: """После ЭЛОУ нефть поступает на блок атмосферной перегонки

Атмосферная перегонка происходит в специальном аппарате - ректификационной колонне, где поддерживается атмосферное давление
Ректификационная колонна представляет собой вертикальный цилиндр, внутри которого расположены специальные перегородки - тарелки
Колонны высокие, их высота может превышать 50 м! Их можно сравнить с 15-ти этажным зданием 

Процесс разделения нефти основан на различии температур кипения ее компонентов. Этот процесс называют ректификацией

Температура кипения углеводородов зависит от их молекулярной массы: у более легких она ниже, у более тяжелых - выше
""",
    4: """Продукты газофракционирующей установки - это отдельные углеводороды или их фракции:

- метан-этановая фракция;
- пропан;
- бутан;
- пентан и выше.

Метан-этановую фракцию, пропан и бутан используют как бытовой газ

Пентановая фракция может использоваться в качестве компонента автомобильного бензина""",
    5: """Изомеризация – реакция получения изомеров из углеводородов с нормальным строением

Типичные реакции изомеризации:""",
    6: """Как известно нефть - это смесь различных углеводородов

И в состав некоторых углеводородов может входить сера. Эти соединения с серой у нас показаны в общем виде как к R-SH, где R - это какой-либо углеводородный радикал

Как раз-таки они и вступают в реакцию с водородом. В результате чего происходит разрыв связи S-C, и сера вместе с водородом образует соединение сероводорода и отделяется

Как мы помним, для протекания процесса нужно наличие катализаторов - веществ, без которых эта реакция бы не проходила или бы проходила, но с очень маленьким выходом

Эти вещества тоже присутствуют в реакторе
""",
    7: """Давай разберемся, как это работает?

Сырьем каталитического крекинга служит вакуумный газойль, который получают на блоке атмосферно-вакуумной переработки

Перед тем как поступить в реактор, сырье предварительно нагревается в печи. Затем оно смешивается с катализатором и попадает в реактор

В реакторе находится слой катализатора, который сверху и снизу поддерживается слоями фарфоровых шариков

При каталитическом крекинге реакции расщепления протекают на поверхности катализатора. И в результате чего образуются отложения кокса, которые закупоривают поры катализатора, тем самым снижая его эффективность

Поэтому необходимо проводить выжигание кокса. Этот процесс называют регенерацией катализатора, и протекает он в регенераторе

Выжигают кокс с помощью обычного горячего воздуха. Образовавшиеся при этом дымовые газы отводятся с верха колонны, а регенерированный катализатор вновь попадает в сырьевой поток
""",
    8: """Теперь перейдем к самой установке

Главные аппараты на установке замедленного коксования - это коксовые камеры, в которых и происходит коксование

Они представляют собой большие вертикальные цилиндрические аппараты 

Процесс протекают следующим образом: сырье для коксования нагревают и подают в нижнюю часть коксовой камеры

Легкие продукты поднимаются в верх камеры и отправляются в колонну для разделения
Тяжёлые продукты остаются и, поскольку нагревание продолжается, уплотняются до кокса, который представляет собой твердое вещество, похожее на уголь

В отличие от ранее описанных процессов коксование является термическим процессом, не использующим катализатор 

В отличие от других установок, является периодической. Две камеры работают поочередно: пока в одной происходит процесс коксования, в другой идет выгрузка кокса

Камеры работают в режиме 48-часового цикла: 

24 часа камера заполняется коксом, удаление кокса занимает около 22 часов, в течение которых заполняется коксом другая камера (соседняя)
Когда камера заполнилась коксом до определенного уровня, ее работу приостанавливают. Камеру охлаждают и выгружают кокс

Над каждой камерой установлены буровые вышки высотой 40 м, которые нужны для подвешивания бурового оборудования 

Буровое оборудование применяется для удаления кокса, это гидродолото и гидрорезак

Сначала используется гидродолото, которым пробуривают центральное отверстие, далее гидродолото снимают и заменяют гидрорезаком 

Гидрорезак снабжен отверстиями, из которых подаются сильные струи воды, которые направляются к стенкам камеры 

Гидрорезак перемещается по камере, полностью удаляя со стенок кокс 
""",
    9: """Нефтепродукты с резервуаров отгружаются либо в железнодорожные цистерны, либо отправляются по трубопроводам к потребителям или же автотранспортом 

Резервуары могут быть металлическими и неметаллическими. Металлические изготавливают из стали, неметаллические - из железобетона или пластмассы

Светлые (легкие) нефтепродукты хранятся преимущественно в стальных резервуарах, это бензин, керосин, дизельное топливо

Темные нефтепродукты, это, например, мазут, хранятся в железобетонных резервуарах
""",
}

first_part_special_ten = {
    0: '''Для школьников организуются различне полезные программы, например эта игра "Производство будущего" проводится для учеников 10-11 классов, абитуриентов и студентов

Чем полезна игра?

Игра - это знакомство с предприятием и его деятельностью. Во время такой игры школьники могут увидеть представителей разных профессий в рабочей обстановке и узнать об организации производства

Таким образом школьники погружаются в корпоративную жизнь компании

Обучение школьников не прекращается и летом. Ребята изучают естественные науки, получают информацию о нефтеперерабатывающем заводе. В это же время подростки участвуют в научно-технических конференциях и олимпиадах

Так происходит подготовка школьников к учебе в высшем учебном заведении, чтобы в будущем они стали хорошими специалистами своей области
''',
    1: """Теперь давай узнаем подробнее, кем можно работать после обучения в университете: 

- Оператором технологической установки 👷

Оператор технологической установки следит за работой оборудования и технологического процесса на производстве. 
Он контролирует показания приборов, регулирует параметры, обеспечивает синхронность работы и участвует в обслуживании оборудования. 

- Лаборантом 👷

Лаборант химического анализа проводит лабораторные исследования, анализируя химический состав и свойства веществ. 
Он занимается подготовкой проб, выполнением анализов, обработкой результатов и ведением документации

- Машинистом компрессорной установки 👷

Машинист компрессорной установки отвечает за эксплуатацию, обслуживание и ремонт компрессорных установок, которые используются для сжатия газов или воздуха в различных промышленных процессах. 
Он следит за работой оборудования, контролирует параметры работы, проводит техническое обслуживание и мелкий ремонт. """,
    2: """В состав офиса входит корпоративный университет

Давайте разберемся, что это такое 🤔

Корпоративный университет - это подразделение организации, которое выполняет образовательные функции для персонала компании. То есть это система внутреннего обучения, которая охватывает все уровни от специалистов до руководителей

Корпоративный университет распространяет корпоративный опыт для сотрудников организации. Это подразделение является составной частью процессов компании

Обучение в корпоративном университете позволяет сотрудникам оперативно получать доступ к образовательным ресурсам

А в чем же разница между классическим и корпоративным университетами?

В корпоративном университете обучение направлено на решение задач конкретной организации  

Давайте вспомним про нашего выпускника, который уже и не выпускник, а сотрудник компании. Он работает здесь уже некоторое время

И как раз наступил момент для повышения квалификации. И наш сотрудник будет повышать квалификацию в корпоративном университете
""",
    3: """"Давайте посмотрим как происходит этот процесс на установке

Нефть перед колонной нагревается в печи, где она испаряется за счет высокой температуры. Пары нефти поступают в колонну, где часть паров поднимается вверх, а остальное конденсируется и стекает вниз

Почему так происходит? А всё потому что вверх уходят фракции с маленькой молекулярной массой (так как они легче), а вниз - тяжелые

Тарелки в колонне нужны для того, чтобы жидкость могла двигаться и стекать по ним, а пары через отверстия в тарелках подниматься вверх 

Чем больше тарелок в ректификационной колонне и чем она выше, тем более узкие фракции можно получить

Продукты разделения нефти отбираются с колонны

Сверху отбирают углеводородные газы, которые отправляются на разделение на газофракционирующую установку

С разных высот колонны выходят фракции: бензиновая, керосиновая и дизельная (дизельное топливо)

• Бензиновая фракция (до 180°C) - сырье для установок получения товарного бензина
• Керосиновая фракция (180-220°C) - компонент авиационного топлива 
• Дизельная фракция (220-350°C) - компонент дизельного топлива

В низу колонны остаются самые тяжелые компоненты - это мазут

Мазут тоже можно разделить, но так как он слишком тяжелый, его мы отправляем на вакуумный блок перегонки
""",
    4: """Как же работает газофракционирующая установка? 

Давайте я вам расскажу!

Газы, пришедшие на установку, поступают в первую колонну, где разделяются на углеводороды С1-С3 и С4+

Легкие газы (С1-С3) уходят с верха колонны во вторую колонну, где происходит разделение уже на метан-этановую фракцию и пропан

С4+ углеводороды из первой колонны уходят снизу и поступают в третью колонну, чтобы отделить бутан от С5+ фракции""",
    5: """Как же работает установка изомеризации? Давайте я вам расскажу!

Сырье подогревается в печи и поступает в реактор

Реактор - цилиндрический аппарат, где протекают реакции изомеризации

В реакторе находится слой катализатора, который сверху и снизу поддерживается слоями фарфоровых шариков
После химического превращения (изомеризации) продуктовая смесь делится в колонне на легкие газы (они уходят сверху) и жидкий продукт (изомеризат), который отбирается с низа колонны

Жидкий изомеризат - это и есть наш высокооктановый компонент для товарного бензина! 
""",
    6: """Теперь время рассказать вам о том, как работает установка гидроочистки

Сырьем для установки гидроочистки являются различные топлива, в данном случае это керосин, дизельное топливо и вакуумный газойль 

Сначала сырье смешивается с водородом, затем эта смесь подается в печь для нагрева

Далее нагретая смесь доставляется в реактор (здесь же находится катализатор), где происходит основная реакция, которую мы рассматривали выше

После реактора очищенные фракции поступают в ректификационную колонну, где происходит разделение смеси по температурам кипения (как на атмосферно-вакуумной перегонке), т.е. на фракции - газы, бензин, керосин, дизельное топливо и т.д.

В реакторе находится слой катализатора, который сверху и снизу поддерживается слоями фарфоровых шариков
""",
    7: """9.3) Продукты реакции направляются в ректификационную колонну на разделение. Из колонны выходят следующие продукты: газы сверху, бензин, легкий газойль и тяжелый газойль

Газы могут отправиться на дальнейшее разделение, на газофракционирующую установку

Целевой продукт процесса - это высокооктановый компонент бензина с октановым числом 80 пунктов и более

Легкий газойль используется как добавка к дизельному топливу

Тяжелый газойль может являться компонентом котельного топлива
""",
    8: """В колонне продукты разделяются на:

◽ газы 
◽ бензин
◽ легкий газойль
◽ тяжелый газойль

Легкие газы с верха колонны уходят на дальнейшее разделение на газофракционирующую установку

Бензин может использоваться как компонент товарного бензина

Легкий газойль используется как добавка к дизельному топливу, которое в свою очередь является топливым для грузовых автомобилей, сельскохозяйственной техники и т.д

Тяжелый газойль используется как котельное топливо

Из коксовой камеры периодически выгружают кокс

Кокс используется в производстве алюминия и стали, в изготовлении электродов и в металлургии
""",
    9: """Резервуары бывают различных объемов, от 5000 до 120 000 кубических метров
 
Также резервуары классифицируются по типу размещения: наземные и подземные
""",
}
first_part_special_pass_two_answer = {
    0: """У тебя еще остались наклейки для школы!

Приклей наклейки с видами деятельности школьников на внутреннее строение школы
""",
    1: """У тебя еще остались наклейки для университета!

Помнишь, я рассказывал тебе о разных профессиях

Внутри корпуса университета есть несколько этажей. Каждый этаж символизирует одну из профессий

Приклей название профессии на нужный этаж 
""",
    2: """А еще у тебя остались наклейки для офиса компании

Помнишь, я рассказывал тебе о структуре офиса

Внутри офиса есть несколько этажей. Каждый этаж символизирует одно из подразделений компании

Подумай, какие подразделения компании здесь изображены 
""",
    3: """У тебя еще остались наклейки для атмосферного блока!

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения блока

А также у вас есть наклейки с рисунками

Например, внутри печки наклейте изображение огня, а рядом с потоком бензина наклейте изображение автомобиля

И не забудьте использовать другие наклейки 
""",
    4: """А еще у тебя остались наклейки для твоей установки

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения установки
""",
    5: """У тебя еще остались наклейки для установки изомеризации!

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения блока

А также у вас есть наклейки с рисунками

Например, рядом с потоком газов на газофракционирующую установку приклейте изображение конфорки

И не забудьте использовать другие наклейки 
""",
    6: """А еще у тебя остались наклейки для твоей установки

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения установки
""",
    7: """У тебя еще остались наклейки для установки каталитического крекинга!

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения блока

А также у вас есть наклейки с рисунками

Например, рядом с бензина приклейте изображение автомобиля 🚗

И не забудьте использовать другие наклейки 
""",
    8: """У тебя еще остались наклейки для установки замедленного коксования!

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения блока

А также у вас есть наклейки с рисунками

Например, рядом с потоком дизельного топлива приклейте изображение грузового автомобиля 

И не забудьте использовать другие наклейки 
""",
    9: """У тебя еще остались наклейки для товарного парка!

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения блока

А также у вас есть наклейки с рисунками

Например, рядом с потоком дизельного топлива приклейте изображение грузового автомобиля 

И не забудьте использовать другие наклейки 
"""
}

first_part_special_eleven = {
    0: 'У тебя еще остались наклейки для университета!'
       '\n\nПомнишь, я рассказывал тебе о разных профессиях'
       '\n\nВнутри корпуса университета есть несколько этажей. Каждый этаж символизирует одну из профессий'
       '\n\nПриклей название профессии на нужный этаж ',
    1: """А еще у тебя остались наклейки для офиса компании

Помнишь, я рассказывал тебе о структуре офиса

Внутри офиса есть несколько этажей. Каждый этаж символизирует одно из подразделений компании

Подумай, какие подразделения компании здесь изображены 
""",
    2: """У вас еще остались акриловые конструкции!

Приклей на правую часть основания макета наклейку с надписью “Вакуумный блок” и используй другие наклейки
""",
    3: """А еще у тебя остались наклейки для твоей установки

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения блока
""",
    4: """У тебя еще остались наклейки для установки изомеризации!

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения блока

А также у вас есть наклейки с рисунками

Например, рядом с потоком газов на газофракционирующую установку приклейте изображение конфорки

И не забудьте использовать другие наклейки 
""",
    5: """А еще у тебя остались наклейки для твоей установки

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения установки
""",
    6: """У тебя еще остались наклейки для установки каталитического крекинга!

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения блока

А также у вас есть наклейки с рисунками

Например, рядом с бензина приклейте изображение автомобиля 🚗

И не забудьте использовать  другие наклейки 
""",
    7: """У тебя еще остались наклейки для установки замедленного коксования!

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения блока

А также у вас есть наклейки с рисунками

Например, рядом с потоком дизельного топлива приклейте изображение грузового автомобиля 

И не забудьте использовать другие наклейки 
""",
    8: """У тебя еще остались наклейки для товарного парка!

У вас есть наклейки названий аппаратов, сырья и продуктов

Используя информацию, которую я тебе присылал выше, наклей их на изображение внутреннего строения блока

А также у вас есть наклейки с рисунками

Например, рядом с потоком дизельного топлива приклейте изображение грузового автомобиля 

И не забудьте использовать другие наклейки 
""",
    9: """У тебя еще остались наклейки для школы!

Приклей наклейки с видами деятельности школьников на внутреннее строение школы
"""
}

first_part_special_twelve = {
    0: """У тебя осталось 6 кубиков и раскройка бумаги №2

Собери кубики в одно целое также, как для университета

И подготовь раскройку №2. Вырежи по контуру технопарк и приклей на получившуюся конструкцию 

Наверх приклей наклейку с надписью “Технопарк”
""",
    1: """Оставшиеся наклейки с названиями подразделений компании приклей на соответствующие им этажи

Одно из подразделений может показаться незнакомым. Я еще не успел рассказать о нем
""",
    2: """У тебя осталось 16 кубиков и раскройка бумаги №5

Собери кубики в одно целое так же, как для атмосферного блока. Только сейчас у тебя получится каркас из 4 кубиков в ширину и 4 кубиков в высоту 

И подготовь раскройку №5. Вырежи по контуру вакуумный блок и приклей на получившуюся конструкцию 

А на верх приклей наклейку с надписью “Вакуумный блок”
""",
    3: """А также у вас есть наклейки с рисунками

Например, рядом с потоком углеводородов пентан и выше (С5+) приклейте изображение автомобиля

И не забудьте использовать  другие наклейки 
""",
    4: """У тебя осталось 25 кубиков и раскройка бумаги №8

Собери кубики в одно целое так же, как для установки изомеризации

И подготовь раскройку №8. Вырежи по контуру установку каталитического риформинга и приклей на получившуюся конструкцию 

Наверх приклей наклейку с надписью “Установка каталитического риформинга”
""",
    5: """А также у вас есть наклейки с рисунками

Например, рядом с потоком сероводорода (отходит с самого верха колонны) приклейте изображение молекулы сероводорода 

И не забудьте использовать другие наклейки 
""",
    6: """У тебя осталось 20 кубиков и раскройка бумаги №11

Собери кубики в одно целое так же, как для установки каталитического крекинга. Только сейчас твой каркас будет состоять из 4 кубиков в ширину и 5 кубиков в высоту

Еще подготовь раскройку №11. Вырежи по контуру установку гидрокрекинга и приклей на получившуюся конструкцию 

Наверх приклей наклейку с надписью “Установка гидрокрекинга”
""",
    7: """У тебя осталось 16 кубиков и раскройка бумаги №13

Собери кубики в одно целое так же, как для установки замедленного коксования

Еще подготовь раскройку №13. Вырежи по контуру установку производства нефтяного битума и приклей на получившуюся конструкцию 

Наверх приклей наклейку с надписью “Установка производства нефтяного битума”
""",
    8: """У тебя осталось 20 кубиков и раскройки бумаги №15 и 16

Собери еще две таких постройки

И подготовь раскройки №15 и 16. Вырежи по контуру товарный парк и приклей на получившиеся конструкции 

Наверх приклей наклейку с надписью “Товарный парк”
""",
    9: """У тебя осталось 6 кубиков и раскройка бумаги №18

Собери еще один каркас так же, как для школы

И подготовь раскройку №18. Вырежи по контуру дом молодежи и приклей на получившуюся конструкцию 

Наверх приклей наклейку с надписью “Дом молодежи”
"""
}

first_part_special_thirteen = {
    0: """Отправляю тебе еще немного теории 📖

Помимо учебы у ребят формируются интересы и хобби

И в доме молодежи ребята посещают кружки различных направлений. Кто-то увлекается танцами и пением, кто-то - поэзией и изобразительным искусством, кто-то - программированием 

В этом же здании проходят различные мероприятия, отчетные концерты. Тут каждый подросток сможет найти близкое ему увлечение 

Также школьники могут посещать технопарк при университете и развиваться в области научно-технического творчества.
Там ребятам получают практические навыки и теоретические знания. Занятия проводятся и в учебное время, и летом - во время каникул

Здесь проводят научные фестивали, конкурсы, конференции и олимпиады

Технопарк поддерживает проведение профориентационных мероприятий для школьников. Школьники работают над созданием индивидуальных проектов под руководством наставников. При необходимости ребята изучают дополнительные предметы

Давай ответим на несколько вопросов
""",
    1: """"А теперь я отправляю тебе еще немного теории 📖

Студенческая жизнь наполнена не только учебой

Так в состав университета входит подразделение с различными творческими направлениями. Ребята посещают кружки. Кто-то увлекается танцами и вокалом, кто-то - поэзией и изобразительным искусством, кто-то изучает иностранные языки 

А кому-то из ребят может быть интересно научно-техническое направление

Давай ответим на несколько вопросов

Сейчас тебе пригодится конспект, который создала твоя команда
""",
    2: """А теперь я отправляю тебе еще немного теории 📖

В офисе расположился спортзал, где любители спорта могут потренироваться

То есть для работников доступны дополнительные активности

Также в компании есть конференц-зал, где проходят различные мероприятия, важные совещания

Еще в компании для сотрудников проводятся активные мероприятия. Например, это может быть спортивное соревнование

Давай ответим на несколько вопросов
""",
    3: """Отправляю тебе еще немного теории 📖

Теперь немного о вакуумном блоке :) 

Мазут из самого низа атмосферной колонны направляется в печь для его предварительного нагрева, а затем в вакуумную колонну на фракционирование (разделение)

На вакуумном блоке мазут разделяется на следующие продукты:

• Тяжелая дизельная фракция (250-360°C) - сырье установок гидроочистки дизельного топлива
• Вакуумный газойль (360-530°C) - сырье установок каталитического крекинга, гидрокрекинга 
• Гудрон - сырье битумной установки, установки получения кокса

Почему блок называют вакуумным? Потому что в колонне не атмосферное давление, а оно ниже, то есть создается вакуум

Но для чего он нужен? 🤔

Всё дело в том, что тяжелые компоненты нефти (которые кипят при температуре выше 350°C) при такой высокой температуре начинают разлагаться. Большие крупные молекулы распадаются на более мелкие и состав этой смеси меняется

Чтобы избежать этого, давление понижают, что приводит к понижению температур кипения этих тяжелых компонентов. Следовательно мазут не разлагается, а просто разделяется на компоненты 

Давай ответим на несколько вопросов
""",
    4: """Отправляю тебе еще немного теории 📖

Что же происходит внутри колонн?

Происходит сложный процесс под интересным названием - ректификация! 

Ректификация простыми словами -  это процесс разделения многокомпонентных смесей на отдельные компоненты

В колонне поддерживается определенная температура, чтобы разделить компоненты по температуре кипения. Легкие газы поднимаются в виде паров вверх, а более тяжелые газы спускаются вниз

Заглянем внутрь колонны

Здесь находятся тарелки - специальные внутренние устройства, благодаря которым происходит ректификация

По тарелкам движется жидкость (это газы, которые сконденсировались), а пары поднимаются вверх через отверствия в тарелках

Чем больше тарелок в ректификационной колонне и чем она выше, тем более узкие фракции можно получить

Давай ответим на несколько вопросов
""",
    5: """Отправляю тебе еще немного теории 📖

Давайте познакомимся с еще одним процессом, который повышает октановое число 

КАТАЛИТИЧЕСКИЙ РИФОРМИНГ

Каталитический риформинг - химический процесс получения ароматических углеводородов

Из простых ациклических алканов с помощью риформинга мы получаем циклические ароматические углеводороды, тем самым повышая октановое число углеводородов

Основная реакция риформинга - это реакция дегидроциклизации

Из нормального гексана получаем циклогексан, при этом отщепляются 2 молекулы водорода 

Далее отщепляются еще 2 молекулы водорода, в итоге на выходе мы получаем бензол 

В итоге мы получаем арен - бензол и 4 молекулы водорода. Водород при этом отправляется на гидроочистку и гидрокрекинг

Давайте узнаем, как работает установка каталитического риформинга

Сырье смешивается с водородом и подается в печь

Уже нагретая смесь поступает в реакторы. В реакторах происходит химическая реакция на катализаторах 

В реакторе находится слой катализатора, который сверху и снизу поддерживается слоями фарфоровых шариков

Далее смесь подается в ректификационную колонну, где делится на легкие газы (уходят сверху) и жидкий продукт (который нефтяники обычно называют риформатом), который уходит снизу

Риформат - это тоже компонент товарного бензина 

Отметим, что октановое число гексана равно примерно 30, а бензола - более 100

Давай ответим на несколько вопросов
""",
    6: """Отправляю тебе еще немного теории 📖

Так почему же надо избавляться от серы в нефтепродуктах? 

Есть несколько причин:

◾ При сгорании топлива, в котором содержится сера, образуются вредные продукты ее сгорания, которые пагубно влияют на окружающую среду

◾ Из-за содержания серы уменьшается октановое число (мера детонационной стойкости)

◾ Сера вызывает коррозию двигателя автомобиля, это приводит к его быстрому изнашиванию

Давай ответим на несколько вопросов
""",
    7: """Отправляю тебе еще немного теории 📖

Теперь я расскажу о гидрокрекинге

Гидрокрекинг тоже каталитический процесс, но в отличие от каталитического крекинга на этой установке используется водород. Вот почему в названии есть приставка “гидро”

Гидрокрекинг позволяет нам превращать тяжелые нефтяные фракции в более легкие и одновременно очищать их от серы и ненасыщенных соединений

Соединения, содержащие серу, нужно удалять. Так как:

▫️ сернистые соединения затрудняют переработку нефти из-за коррозии аппаратов и снижения эффективности катализаторов

▫️ сернистые соединения в топливах увеличивают расход топлива, способствуют коррозии двигателя

▫️ оксиды серы SO2 и SO3 загрязняют атмосферу, вместе с влагой воздуха образуют сернистую и серную кислоты

​​В процессе гидрокрекинга происходят следующие превращения:

1️⃣ Гидроочистка - из сырья удаляются серосодержащие соединения

2️⃣ Расщепление тяжелых молекул углеводородов на более мелкие

3️⃣ Насыщение водородом непредельных углеводородов (гидрирование)

Реакции покажем на картинке

А пока давай разберемся, как это работает

Сырьем для процесса гидрокрекинга является вакуумный газойль с установки вакуумной перегонки нефти 

Сырье предварительно нагревается в печи и затем смешивается с водородом

Газосырьевая смесь вводится в реактор сверху

На катализаторе идет кре­кинг. Чтобы крекинг продолжался, требуется подвод теп­ла, то есть это - эндотермический процесс

В то же время водород реагирует с молекулами, которые образуются при крекинге, насыщая их, и при этом выделяется теп­ло. Другими словами, это реакция гидрирования, которая является экзотермической

Таким образом, водород дает тепло, необходимое для протекания кре­кинга

Выходящая из реактора смесь продуктов реакции направляется  в колонну для разделения продуктов по фракциям

Смесь делится на следующие фракции:
газы (идут на дальнейшее разделение на газофракционирующую установку)
бензин (компонент товарного бензина), или его еще называют катализатом 
реактивное топливо (топливо для авиации)
дизельное топливо 
остаток гидрокрекинга (котельное топливо)

Итак, гидрирование нужно, чтобы получать насыщенные углеводороды, потому как они  менее реакционноспособные  по сравнению с ненасыщенными. Чем выше содержание последних в топливе, тем быстрее оно портится

Давай ответим на несколько вопросов
""",
    8: """Отправляю тебе еще немного теории 📖

Теперь пришло время установки получения нефтяного битума!

Битум - это твердое вещество (внешне похожее на смолу), которое используется в строительстве и для приготовления асфальта 

Чтобы получить битум нам нужны: гудрон, воздух и аппарат, в котором мы будем его получать

Гудрон на установку производства нефтяного битума приходит с установки атмосферно-вакуумной перегонки нефти, воздух берется из атмосферы. А происходит это всё в специальном аппарате - колонне окисления

Гудрон окисляется воздухом и превращается в битум

Сырье нагревается в печи и подается в низ колонны с воздухом. Воздух продувается через слой жидкости гудрона

В колонне окисления протекает множество реакций по радикальному механизму, в итоге получается битум, в который входят асфальто-смолистые вещества

Из колонны сверху отводятся газообразные продукты окисления, а еще отбирается битум

Давай ответим на несколько вопросов                      
""",
    9: """Итак, у вас получилось 5 резервуаров

В первый резервуар поступает изомеризат с установки изомеризации, во второй - риформат с установки каталитического риформинга, в третий - катализат с установки каталитического крекинга, в четвертый - дизельное топливо с установки гидрокрекинга, в пятый - дизельное топливо с установки гидроочистки, в шестой - керосин с установки гидроочистки

Давай ответим на несколько вопросов
"""
}

first_part_special_fourteen = {
    0: """Для чего школьникам профориентационные проекты?""",
    1: 'Расположи в порядке возрастания структуру университета:',
    2: """Основная функция отдела развития персонала""",
    3: """Что такое ректификация? Это процесс…""",
    4: """Что НЕ входит в широкую фракцию легких углеводородов? """,
    5: """Что такое октановое число?""",
    6: """Зачем нужен водород для процесса гидроочистки? Для ...""",
    7: """Какой процесс НЕ происходит во время гидрокрекинга?""",
    8: """Зачем нужен воздух в процессе получения нефтяных битумов?""",
    9: """Как нефтепродукты НЕ доставляются потребителям из резервуарного парка?""",
}

first_part_special_fifteen = {
    0: """Профориентационные проекты направлены на помощь школьникам в определении их будущей профессии""",
    1: 'В порядке возрастания: кафедра, факультет/институт, университет',
    2: """Основная функция отдела развития персонала - подбор персонала""",
    3: """Ректификация - это процесс разделения многокомпонентной смеси на индивидуальные компоненты""",
    4: """В широкую фракцию легких углеводородов не входит метанол""",
    5: """Октановое число - мера стойкости топлива к самовозгоранию""",
    6: """Водород в процессе гидроочистки нужен для гидрирования серосодержащих соединений""",
    7: """Во время гидрокрекинга происходят процессы гидроочистки, гидрирования и крекинга""",
    8: """В процессе получения нефтяных битумов воздух необходим для окисления гудрона""",
    9: """Нефтепродукты с резервуаров отгружаются либо в железнодорожные цистерны, либо отправляются по трубопроводам к потребителям или же автотранспортом  """,
}

first_part_special_sixteen = {
    0: '''Для чего проводится игра "Производство будущего"?''',
    1: 'Какой специалист следит за работой оборудования и технологического процесса на производстве?',
    2: """Где сотрудники компании могут повысить свою квалификацию?""",
    3: """Мазут - это продукт...""",
    4: """Какой углеводород может использоваться в качестве компонента автобензина?""",
    5: """Какие углеводороды повышают октановое число?""",
    6: """Чем вредна сера для двигателей автомобиля?""",
    7: """Что является продуктом гидрокрекинга?""",
    8: """Из чего получают нефтяной битум?""",
    9: """Зачем на НПЗ нужны товарные парки?""",
}

first_part_special_seventeen = {
    0: """Игра проводится для знакомства с предприятием и его деятельностью""",
    1: 'Оператор технологической установки следит за работой оборудования и технологического процеса на производстве',
    2: """Сотрудники компании могут повысить свою квалификацию в корпоративном университете""",
    3: """Мазут - это продукт атмосферного блока перегонки нефти""",
    4: """В качестве компонента автобензина может использоваться пентан""",
    5: """Октановое число повышают ароматические, непредельные и разветвленные углеводороды""",
    6: """Сера вызывает коррозию у двигателей автомобиля""",
    7: """Дизельное топливо является продуктом гидрокрекинга""",
    8: """Нефтяной битум получают из гудрона""",
    9: """Товарные парки на НПЗ нужны для хранения нефтепродуктов""",
}

first_part_special_eighteen = {
    0: """Какие мероприятия могут помочь подросткам погрузиться в корпоративную жизнь компании?""",
    1: 'Кто проводит анализы нефти и продуктов ее переработки?',
    2: """Какие задачи выполняют сотрудники отдела развития персонала?""",
    3: """Зачем в вакуумном блоке создавать вакуум? Чтобы ...""",
    4: """Зачем нужны тарелки в колоннах?""",
    5: """Какие реакции НЕ способствует повышению октанового числа?""",
    6: """Куда продукты гидроочистки поступают после реактора?""",
    7: """Сырьем каталитического крекинга является""",
    8: """Откуда приходит гудрон?""",
    9: """Из какого материала делают резервуары товарного парка?""",
}

first_part_special_nineteen = {
    0: """Подростки могут погрузиться в корпоративную жизнь компании при обучении в профильном классе, при участии в профориентационных проектах и посещении экскурсий на предприятия""",
    1: 'Анализы нефти и продуктов ее переработки проводит лаборант',
    2: """Сотрудники отдела развития персонала проводят корпоративные мероприятия, занимаются подбором персонала вместе с руководителями подразделений, подготавливают планы повышения квалификации работников""",
    3: """В вакуумном блоке создают вакуум, чтобы снизить температуру кипения компонентов""",
    4: """Тарелки в колоннах нужны для проведения процесса ректификации""",
    5: """Не способствует повышению октанового числа реакции гидрирования""",
    6: """Продукты гидроочистки после реактора поступают в ректификационную колонну""",
    7: """Сырьем каталитического крекинга является вакуумный газойль""",
    8: """Гудрон приходит с установки атмосферно-вакуумной перегонки""",
    9: """Резервуары могут быть металлическими и неметаллическими. Металлические изготавливают из стали, неметаллические - из железобетона или пластмассы""",
}

first_part_special_twenty = {
    0: """""",
    1: """""",
    2: """""",
    3: """""",
    4: """""",
    5: """""",
    6: """""",
    7: """""",
    8: """""",
    9: """"""
}

first_part_before_password = {
    0: """Сейчас мы достраиваем наш НПЗ, осталось нанести последние штрихи! """,
    1: """Сейчас мы достраиваем наш НПЗ, осталось нанести последние штрихи! """,
    2: """Сейчас ваша задача отвести потоки, выходящие из атмосферной и вакуумной колонн

Чтобы это сделать правильно, вам пригодится теория, которую вы изучили ранее

Также вам пригодится цветной маленький скотч, с помощью которого вы должны провести потоки от своей установки к установкам других ребят

Например, газы с верха атмосферной колонны отправляются на газофракционируюущую установку (ГФУ)

Возьмите скотч, отрежьте нужную длину для того, чтобы провести этот поток газов до границ соседней установки, а команда установки ГФУ должны в свою очередь провести поток к вам

Также проделайте с остальными потоками вашей установки

Советую подписать на скотче названия потока, чтобы он не спутался с другими
""",
    3: """Сейчас ваша задача подвести сырье для вашей установки

Чтобы это сделать правильно, вам пригодится теория, которую вы изучили ранее

Также вам пригодится цветной маленький скотч, с помощью которого вы должны провести поток к своей установки от установки других ребят

Возьмите скотч, отрежьте нужную длину для того, чтобы провести этот поток газов до границ соседней установки, а команда другой установки должны в свою очередь провести поток к вам

Советую подписать на скотче названия потока, чтобы он не спутался с другими
""",
    4: """Сейчас ваша задача подвести сырье к своей установке и отвести потоки продуктов, выходящие из ректификационных колонн

Чтобы это сделать правильно, вам пригодится теория, которую вы изучили ранее

Также вам пригодится цветной маленький скотч, с помощью которого вы должны провести потоки от своей установки к установкам других ребят

Например, газы с верха ректификационной колонны отправляются на газофракционируюущую установку (ГФУ)

Возьмите скотч, отрежьте нужную длину для того, чтобы провести этот поток газов до границ соседней установки, а команда установки ГФУ должны в свою очередь провести поток к вам

Также проделайте с остальными потоками вашей установки

Советую подписать на скотче названия потока, чтобы он не спутался с другими
""",
    5: """Сейчас ваша задача подвести сырье к своей установке и отвести потоки продуктов, выходящие из ректификационной колонны

Чтобы это сделать правильно, вам пригодится теория, которую вы изучили ранее

Также вам пригодится цветной маленький скотч, с помощью которого вы должны провести потоки от своей установки к установкам других ребят

Например, дизельное  топливо из колонны отправляются в товарный парк 

Возьмите скотч, отрежьте нужную длину для того, чтобы провести этот поток газов до границ соседней установки, а команда товарного парка должны в свою очередь провести поток к вам

Также проделайте с остальными потоками вашей установки

Советую подписать на скотче названия потока, чтобы он не спутался с другими
""",
    6: """Сейчас ваша задача подвести сырье к своей установке и отвести потоки продуктов, выходящие из ректификационных колонн

Чтобы это сделать правильно, вам пригодится теория, которую вы изучили ранее

Также вам пригодится цветной маленький скотч, с помощью которого вы должны провести потоки от своей установки к установкам других ребят

Например, катализат с установки каталитического крекинга с колонны отправляется в товарный парк

Возьмите скотч, отрежьте нужную длину для того, чтобы провести этот поток газов до границ соседней установки, а команда товарного парка должны в свою очередь провести поток к вам

Также проделайте с остальными потоками вашей установки

Советую подписать на скотче названия потока, чтобы он не спутался с другими
""",
    7: """Сейчас ваша задача подвести сырье к своей установке 

Чтобы это сделать правильно, вам пригодится теория, которую вы изучили ранее

Также вам пригодится цветной маленький скотч, с помощью которого вы должны провести потоки от своей установки к установкам других ребят

Например, гудрон приходит с вакуумного блока 

Возьмите скотч, отрежьте нужную длину для того, чтобы провести этот поток газов до границ соседней установки, а команда атмосферно-вакуумной перегонки должны в свою очередь провести поток к вам

Также проделайте с остальными потоками вашей установки

Советую подписать на скотче названия потока, чтобы он не спутался с другими
""",
    8: """Сейчас ваша задача подвести продукты к вашему товарному парку 

Чтобы это сделать правильно, вам пригодится теория, которую вы изучили ранее

Также вам пригодится цветной маленький скотч, с помощью которого вы должны провести потоки от своей установки к установкам других ребят

Например, катализат с установки каталитического крекинга с колонны отправляется в товарный парк

Возьмите скотч, отрежьте нужную длину для того, чтобы провести этот поток газов до границ соседней установки, а команда каталитического крекинга должны в свою очередь провести поток к вам

Также проделайте с остальными потоками вашей установки

Советую подписать на скотче названия потока, чтобы он не спутался с другими
""",
    9: """Сейчас мы достраиваем наш НПЗ, осталось нанести последние штрихи! """
}
